import telebot
from telebot import types
import time
import db
from db import cur


STATIC_PASSWORD = "0000"
task_start_times = {}
task_finish_buttons = {}
completed_tasks = {}
started_tasks = {}

TOKEN = ""
bot = telebot.TeleBot(TOKEN)

channel_id = -1002161001933


def get_task_description(task_type):
    descriptions_dict = {
        'sis09': "Т.К. 009.00.00: Буксировка ВС",
        'sis10': "Т.К. 010.10.00: Установите упорные колодки под колеса основных опор под колеса, заземлите вертолет",
        'sis12': "Т.К. 012.10.00: Подготовьте наземное оборудование, необходимое для технического обслуживания",
        'sis80': "080.12.00 TK 203: Осмотр и промывка воздушного стартера",
        'sis148': "Т.К. 148.10.00а: Осмотр агрегатов воздушной системы охлаждения",
        'Lubricaticon': "Карта смазки",
        'Finish work': "Заключительные работы",
        'sis21g': "Т.К. 021.40.00g: Проверка состояния свечевого узла обогревателя КО-50",
        'sis21a': "Т.К. 021.00.00a: Осмотррите и проверьте работоспособность электровентиляторов обдува ДВ-302Т "
                  "индивидуального пользования",
        'sis21b':  "021.40.00c: Проверьте работоспособность обогревателя Ко-50",
        'sis23a': "Т.К. 023.30.00a: Проверьте функционирование СПУ-7. ",
        'sis23b': "Т.К. 023.40.00a: Проверьте функционирование переговорного устройства СПУ-7.",
        'sis23с': "Т.К. 023.30.00a: Проверьте функционирование СГУ-15. ",
        'sis23d': "Т.К. 23.51.00.а,b: Внешний осмотр и проверка целости шумозащитных и головного "
                                  "амортизаторов, гигиенических чехлов, оболочек кабеля и вилки соединителя ",
        'sis23e': "Т.К. 023.20.00f: Проверьте функционирование основной и резервной радиостанции "
                                  "Орлан-85СТ. ",
        'sis23q': "Т.К. 023.10.01b: Проверьте состояние, крепление и натяжение антенн и их элементы.",
        'sis23g': "Т.К. 023.10.01d: Проверьте функционирование р/ст Прима-КВ. ",
        'sis23i': "Т.К. 023.11.10с: Проверьте внешнее состояние блоков аварийного радиомаяка АРМ-406П "
                                  "(блока «П»; пульта управления ПДУ-406; антенны АНТ-406В). Осмотрите "
                                  "блоки, убедитесь в наличии бандероли и исправности застежки крепления моноблока "
                                  "АС1А в кожухе блока «П», подсоединения Ш, отсутствии внешних повреждений, "
                                  "пыли и загрязнений. ",
        'sis23p': "Т.К. 023.11.10d:Проверьте функционирование моноблока «П» радиомаяка АРМ-406П в "
                                   "режиме встроенного контроля (ВСК) от ПДУ. ",
        'sis23r': "Т.К. 023.12.01f: Проверьте состояние и крепление и амортизацию блока,"
                                  " состояние разъемов, кабелей изделия Алмаз-УПМ; убедитесь в чистоте и отсутствии "
                                  "механических повреждений изделий. ",
        'sis23u': "Т.К. 023.20.00е: Осмотрите и проверьте состояние и крепление антенн радиостанций "
                                  "Орлан-85СТ. Убедитесь в чистоте и отсутствии механических повреждений. ",
        'sis23o': "Т.К. 023.20.00k:Внешний осмотр блоков радиостанций Орлан-85СТ на вертолете ",
        'sis23y': "Т.К. 023.70.01d: Проверка работоспособности П-507М при подаче напряжения питания "
                                  "(самодиагностика без индикации)",
        'sis23t': "Т.К. 023.70.01f: Проверка работоспособности изделия в режиме проверки "
                                  "записи при помощи ВИКУ",
        'sis24k': "Т.К. 24.30.03f: Проверка работы системы постоянного тока",
        'sis24m': "Т.К. 24.30.00g: Проверка внешнего состояния и надежности крепления "
                                  "выпрямительных устройств ВУ-6Б",
        'sis24r': "Т.К. 24.30.00h: Очистка лопаток вентилятора выпрямительного устройства "
                                  "от накопившейся пыли",
        'sis24q': "Т.К. 24.30.00i: Проверка работоспособности обогрева аккумуляторов"
                                  "(Работу выполнять при отрицательной температуре)",
        'sis24t': "Т.К. 24.50.00b: Осмотр распределительных устройств и аппаратуры, смонтированной"
                                  " в них",
        'sis24y': "Т.К. 24.50.00c: Осмотр минусовых проводов",
        'sis24u': "Т.К. 24.60.00a: Осмотр металлизации конструкции и оборудования вертолета",
        'sis24o':  "Т.К. 24.20.00p: Проверка внешнего состояния и надежности крепления блока "
                                  "трансформаторов P/N 20736-100",
        'sis24s': "Т.К. 24.20.00p: Проверка работы генератора ВСУ Safir",
        'sis24w': "Т.К. 24.20.00c1: Т.К. 24.20.00c1: Проверьте внешнее состояние и надежность крепления "
                                   "трансформаторов ТС310С04Б и преобразователя СПО-9",
        'sis24i': "Т.К. 024.20.00e1: Проверьте внешнее состояние, надежность крепления блоков "
                                  "БРН120Т5А, БЗУНП355Г и рамы РМ355Г)",
        'sis24p': "Т.К. 024.20.00f1:Проверьте внешнее состояние, надежность крепления "
                                  "трансформаторов Тр115/36 и автоматов АПШ-3М)",
        'sis24z': "Т.К. 024.20.00b1: Проверьте работу преобразователей ПТС-800БМ, СПО-9 и "
                                  "трансформаторов ТСЗ10С04Б, Тр115/36)",
        'sis24x': "Т.К. 024.20.00а1: При опробовании двигателей проверьте работу системы переменного"
                                  " тока",
        'sis24c': "Т.К. 024.20.00g1,h1: Проверьте внешнее состояние блока трансформаторов"
                                  " P/N 20736-100 и коробки управления P/N 2438-100, убедитесь в надежности их "
                                  "крепления,",
        'sis24f': "Т.К. 024.20.00j1: Проверьте работоспособность генераторов ВСУ.",
        'sis24a': "Т.К. 024.30.00а1: Проверьте работу системы постоянного тока.",
        'sis24g': "Т.К. 024.30.00b1: Проверьте работоспособность дифференциальных реле ДМР-200ВУ",
        'sis24h': "Т.К. 024.30.00b1,с1: Проверьте внешнее состояние и надежность крепления и "
                                  "очистите выпрямительные устройства ВУ-6Б",
        'sis24j': "Т.К. 024.40.00b1,с1: Проверьте работоспособность сети внешнего питания",
        'sis24d': "Т.К. 024.50.00b1: Осмотрите и проверьте распределительные устройства и "
                                  "аппаратуру, смонтированную в них",
        'sis24l': "Т.К. 024.50.00с1: Осмотрите минусовые провода",

        'sis28g': "Т.К. 028.20.00a: Осмотр и проверка состояния и крепления агрегатов",
        'sis28h': "Т.К. 028.20.00e: Осмотр и проверка состояния и крепления топливного насоса 463Б ",
        'sis28j': "Т.К. 028.70.00g: Проверка момента затяжки гаек стяжных тросов крепления ",
        'sis28a': "Т.К. 028.20.00c,d: Проверка работоспособности топливных насосов",
        'sis28b': "Т.К. 028.40.00c: Проверка исправности ламп табло БАК ПОЛОН",
        'sis28c': "Т.К. 028.40.00d: Проверка работоспособности топливомера",
        'sis28d': "Т.К. 028.40.00d: Проверьте работоспособность топливомера..",
        'sis28f': "Т.К. 028.40.00e: Осмотрите и проверьте состояние и крепление сигнализаторов"
                                  " давления СД-29А.",
        'sis28r':  "Т.К. 028.40.00f: Проверьте внешнее состояние и крепление датчиков топливомера "
                                  "СКЭС-2027Б.",
        'sis29a': "Т.К. 029.30.00a: Осмотр датчиков ИД-100, манометров ДИМ-100 и сигнализаторов  давления "
                  "МСТ-30А и МСТ-25А",
        'sis29b': "Т.К. 029.10.00e: Проверьте зарядку гидроаккумуляторов",
        'sis29c': "Т.К. 029.10.00o: Проверка и промывка фильтров ФГ11БН и 8Д2.966.017-2",
        'sis30a':  "Т.К. 030.20.00a: Осмотр терморегуляторов ТЭР-1М",
        'sis30b': "Т.К. 030.40.00a: Осмотр электроагрегатов противообледенительной системы стекол",
        'sis30c': "Т.К. 030.40.00d: Проверка надежности подсоединения проводов к термодатчикам "
                                  "стекол",
        'sis30d': "Т.К. 030.60.00a: Осмотр агрегатов и жгутов противообледенительной системы винтов",
        'sis30h': "Т.К. 030.60.00f: Продуйте узел контактных колец токосъемника рулевого винта "
                                  "сжатым воздухом.",
        'sis30e': "Т.К. 030.80.00a: Осмотр датчика сигнализатораобледенения из комплекта СО-121ВМ",
        'sis30f': "Т.К. 030.80.00b: Осмотр преобразователя сигнализатора обледенения из комплекта "
                                  "СО-121ВМ",
        'sis30g': "Т.К. 030.80.00c: Проверка работоспособности сигнализатора обледенения СО-121ВМ",
        'sis30q': "Т.К. 030.80.00d: Проверьте сигнализатор обледенения СО-121ВМ.",
        'sis31a': "Т.К. 031.20.00: Проверьте функционирование авиационных часов.",
        'sis31b': "Т.К. 031.10.00b: Вскройте панели приборных досок. Осмотрите электропроводку, "
                                  "штепсельные разъемы.",
        'sis31c':  "Т.К. 031.10.00а: Осмотрите высотомеры, убедитесь в отсутствии повреждений и "
                                  "наличии краски (колпачков) фиксирующей кремальеры. По их шкалам убедитесь в"
                                  " соответствии барометрического давления атмосферному, приведенному к месту стоянки.",
        'sis32a': "Т.К. 032.10.00c: Проверка зазора в микровыключателях АМ-800К механизмов"
                  " включения гидроупоров",
        'sis32b': "Т.К. 032.41.00a: Осмотр корпуса дискового тормоза и блока цилиндров",

        'sis32c': "Т.К. 032.41.00a: Проверьте работоспособность тормозных колес основных "
                                  "опор шасси",
        'sis33a': "Т.К. 033.10.00a: Осмотр осветительного оборудования кабины экипажа",

        'sis33b': "Т.К. 033.30.00a: Осмотр стекол плафонов осветительного оборудования "
                                  "грузовых и технических отсеков",
        'sis33c': "Т.К. 033.40.00a,b,c,d,e,f: Осмотр светофильтров и стекол внешнего "
                                  "осветительного и светосигнального оборудования",
        'sis34a': "Т.К. 034.10.00b: Проверка герметичности системы ПВД",
        'sis34b':  "Т.К. 034.10.00d: Проверьте функционирование обогрева приемников ПВД "
                                  "(по загоранию табло).",
        'sis34c': "Т.К. 034.10.00d: Проверьте функционирование обогрева приемников ПВД "
                                  "(по загоранию табло).",
        'sis34d': "Т.К. 034.20.00n: Проверьте функционирование выключателя коррекции ВК-53РВ.",
        'sis34e': "Т.К. 034.20.00f: Проверьте функционирование авиагоризонтов АГБ-ЗК (раздельно от "
                                  "основного источника и резервного преобразователя)",
        'sis34o': "Т.К. 034.20.00r: Проверьте функционирование курсовой системы ГМК-1А.)",
        'sis34g': "Т.К. 034.20.00h: Проверьте функционирование блока сравнения и сигнализации "
                                  "предельных кренов БСПК-1..)",
        'sis34h': "Т.К. 034.10.00a: Осмотрите агрегаты системы ПВД. Убедитесь в отсутствии "
                                  "повреждений, надежности подсоединения трубопроводов, исправности контровки. "
                                  "Слейте конденсат из влагоотстойников. Прочистите отверстия приемника "
                                  "статического давления корректора высоты КВ-11 автопилота.)",
        'sis34j': "Т.К. 034.20.00b: Осмотрите компас КИ-13. Убедитесь в надежности его крепления, "
                                  "в наличии контровки винтов девиационного устройства, в наличии графика "
                                  "девиационных поправок на вертолете.)",
        'sis34k': "Т.К. 034.20.00с: Убедитесь в наличии таблиц показаний высотомеров, указателей"
                                  " скорости и графиков девиации КИ-13К и ГМК-1, в соответствии номеров приборов"
                                  " номерам, указанным в таблицах.)",

        'sis36a': "Т.К. 036.10.00b: Проверка состояния агрегатов и трубопроводов "
                                  "пневматической системы",
        'sis36b': "Т.К. 036.10.00f: Осмотр и замена фильтра компрессора АК-50Т1",
        'sis49a': "Т.К. 049.40.00a: Убедитесь в надежности крепления электроагрегатов , жгутов,"
                                  "штепсельных разьемов  ВСУ Safir",
        'sis49b': "Т.К. 049.40.00d: Произвести тест-контролькоробки управления P/N2438-100 "
                                  "ВСУ Safir",
        'sis49c': "Т.К. 049.70.00b: У указателя температуры LUN 1386.01 проверьте: - надежность "
                                  "подсоединения проводов термопар к датчику; - внешнее состояние и крепление; "
                                  " сопротивление изоляции цепи термопар датчика температуры LUN 1385.81",
        'sis49cd': "Т.К. 049.40.00e: Проверка внешнего состояния и надежности крепления коробки "
                                   "управления LUN 5271.80/CONB-",

        'sis53a': "Т.К. 053.10.00а: Осмотрите изнутри каркас хвостовой балки, болты стыковки"
                                  " хвостовой балки с фюзеляжем и концевой балкой. Убедитесь в отсутствии "
                                  "трещин на уголках и кницах, ослаблении заклепок и болтовых соединений "
                                  "пневматической системы",

        'sis53b': "Т.К. 053.10.00ɡ: Осмотрите изнутри грузовой кабины шп. №7 и №10 ЦЧФ в зоне"
                                  " крепления узлов основных опор вертолета.",

        'sis53c': "Т.К. 053.40.00с: Осмотрите фитинги и опоры хвостового вала трансмиссии,"
                                  " кронштейны для колодок под тросы управления рулевым винтом.",
        'sis65a': "Т.К. 065.10.00j: Осмотрите ЛНВ.Убедитесь в отсутствии механических повреждений,"
                                  " вспучивания и отставания обшивки, оковок, резиновых накладок, растрескивания "
                                  "и выкрашивания герметика в стыках хвостовых отсеков.",
        'sis65b': "Т.К. 065.10.00k: Осмотрите проушины комлевых наконечников и их пластины в местах "
                                  "установки болтов, проверьте контровку гаек болтов крепления лопастей к втулке "
                                  "несущего винта. Проверьте по меткам затяжку винтов концевых обтекателей.",
        'sis65c': "Т.К. 065.12.00c: Осмотрите состояние гасителя вибрации.",
        'sis65d': "Т.К.065.10.00r: Снимите и осмотрите магнитные пробки осевых шарниров втулки несущего"
                                  " винта.",
        'sis65e': "Т.К.065.20.00i: Осмотрите лопасти рулевого винта и проверьте простукиванием и на"
                                  " ощупь состояние приклейки обшивки хвостовых отсеков, нагревательных накладок,"
                                  "резиновых накладок и оковок..",
        'sis65f': "Т.К.065.20.00m: Замерьте осевой люфт подшипника штока рулевого винта."
                                  "Люфт = ______________ мм",

        'sis65g': "Т.К.065.20.00n: Замерьте люфт валиков и вилок рычагов поворота лопастей."
                                  "в плоскости тяги №1= №2= №3="
                                  "в плоскости вращ. №1= №2= №3="
                                  "осевой люфт вилок №1= №2= №3=",

        'sis65r': "Т.К.065.20.00с: Проверьте работу шарниров втулки рулевого винта",

        'sis65h': "Т.К.065.40.00е,f: Осмотрите тяги, кронштейны, рычаги и качалки всех цепей управления."
                                  "Убедитесь, что на них нет механических повреждений. Убедитесь в надежности всех "
                                  "соединений, в  наличии и исправности контровки болтовых соединений.",

        'sis65j': "Т.К.065.40.00с: Проверьте работоспособность электромеханизма МП-100М в системе "
                                  "перенастройки оборотов двигателей.",

        'sis65k': "Т.К.065.40.00i: Проверьте регулировку микровыключателя механизма подвижного "
                                  "упора системы СПУУ-52-1.",
        'sis65x':  "Т.К.065.40.00δ(кроме п.3): Осмотрите кронштейн крепления гидроусилителей."
                                  " Убедитесь в отсутствии трещин на кронштейне. Проверьте крепление кронштейна к "
                                  "главному редуктору и опор агрегатов управления к кронштейну.",
        'sis65d1': "Т.К. 065.40.00i: Проверка регулировки микровыключателя механизма подвижного"
                                   " упора системы СПУУ-52",
        'sis65a1xx': "065.10.00f: Выполните проверку момента затяжки гайки крепления "
                                  "втулки несущего винта на валу главного редуктора;",
        'sis65b1xx': "065.10.00е: Выполните проверку момента затяжки болтов крепления рычагов "
                                   "поворота лопастей и гаек болтов крепления кронштейнов гидродемпферов к "
                                   "цапфам осевых шарниров;",
        'sis65d1xx': "065.20.00d: Выполните проверку моментов затяжки гаек болтов крепления втулки "
                                     "рулевого винта к фланцу вала хвостового редуктора.;",
        'sis71a': "Т.К. 071.00.00a: Осмотр патрубков из КПВ ТВ3-117ВМ",
        'sis71b': "Т.К.071.00.00b: Слейте конденсат из влагоотстойника системы синхронизации "
                                  "мощности двигателей ТВ3-117ВМ.",
        'sis71c': "Т.К. 071.60.00а,п. 1-5,9: Демонтируйте обтекатели левого и правогодвигателя.",
        'sis71e': "Т.К. 071.60.00d: Осмотрите сепараторы ПЗУ двигателей.",
        'sis71f': "Т.К. 071.60.00d: Осмотрите поворотный патрубок и раструб вывода пыли "
                                  "ПЗУ двигателей.",
        'sis71g': "Т.К. 071.60.00 п. 8, 10: Установите обтекатели ПЗУ.",
        'sis71h': "Т.К. 071.60.00с: Проверьте работу ПЗУ в режиме пылеочистки.",
        'sis72a': "Т.К.072.00.00 TK 601,603: Наружный осмотр двигателей",

        'sis72b': "Т.К.072.00.00 TK 705: Очистка проточной части двигателя",
        'sis72i': "Т.К.072.00.00 TK ТК 603: Осмотрите воздухопроводы системы запуска двигателей "
                                  "ТВ3-117ВМ, убедитесь в их исправности и надежности крепления.",
        'sis72g': "Т.К.072.00.00 TK ТК 606: Проверьте соосность двигателя с главным редуктором.",
        'sis72c':  "Т.К. 072.30.00 TK 201: Проверьте положение стрелок лимбов направляющих аппаратов"
                                  " компрессора. (Стрелки должны находиться на угле 27+1,5°.)",
        'sis72d': "Т.К. 072.30.00 TK 201: Проверьте положение стрелок лимбов направляющих аппаратов"
                                  " компрессора. (Стрелки должны находиться на угле 27+1,5°.)",
        'sis72e': "Т.К. 072.30.00 TK 201: Осмотрите входные каналы двигателей, лопатки ВНА,"
                                  " лопатки первой ступени компрессора, убедитесь в отсутствии посторонних "
                                  "предметов, чистоте каналов, ослабления заклепок, механических повреждений,"
                                  " эрозионного износа и течи масла из первых опор двигателей."
                                  " компрессора. (Стрелки должны находиться на угле 27+1,5°.)",
        'sis72f':  "Т.К. 072.30.00 TK 202: При снятом обтекателе произведите замер износа рабочих"
                                  " лопаток первой ступени ротора компрессора)",
        'sis72h': "Т.К. 072.90.00 TK 204: Снимите, осмотрите и промойте защитный фильтр в "
                                  "трубопроводе отвода масла из четвертой и пятой опор.)",
        'sis72j': "Т.К. 072.90.02 TK ТК 201,202: Снимите, осмотрите и промойте масляный фильтр.)",
        'sis72k': "Т.К. 072.90.13 TK ТК 201: Снимите, осмотрите, промойте и проверьте "
                                  "срабатывание сигнализатора стружки..)",
        'sis72l':  "Т.К. 072.00.00 ТК 507, 603: Запустите, прогрейте и опробуйте двигатель. "
                                  "срабатывание сигнализатора стружки..)",
        'sis72q': "Т.К. 072.00.00 ТК 507, 603: После пробы проверьте герметичность "
                                  "соединений по разъемам:"
                                  "- масляных фильтров;"
                                  "- топливных фильтров;"
                                  "- топливных фильтров насосов-регуляторов.",
        'sis73a': "Т.К. 073.02.00 TK 202: Прочистите жиклерное отверстие эжектора с продувкой"
                                  " воздушного трубопровода.",
        'sis73b': "Т.К. 073.11.04 TK 205: Замените (осмотрите и промойте) фильтроэлемент топливного"
                                  " фильтра.",
        'sis73c': "Т.К. 073.12.05 TK 602: Снимите, осмотрите и промойте воздушный фильтр "
                                  "насоса-регулятора НР-3ВМ.",
        'sis73d': "Т.К. 073.12.05 TK 603: Снимите, осмотрите и прочистите воздушные жиклёры "
                                  "АЗ и АП с переходниками.",
        'sis73e': "Т.К. 073.12.05 TK 604: Снимите, осмотрите и промойте топливные "
                                  "фильтры насоса-регулятора НР-3ВМ.",
        'sis73f': "Т.К. 073.12.05 ТК 303, п.1: Стравите воздух из топливной системы двигателей.",
        'sis73l': "Т.К. 073.12.05 ТК 303, п.1: Снимите, осмотрите и промойте топливный фильтр "
                                  "исполнительного механизма ИМ-3А..",
        'sis73a1': "Т.К. 073.10.00a: Проверка внешнего состояния и надежности крепления регулятора"
                                  " температуры РТ-12-6",
        'sis77a': "Т.К. 077.20.00a: Осмотр усилителя 2УЭ-6Б из комплекта 2ИА-6",
        'sis77b': "Т.К. 077.20.00b: Проверка измерительной аппаратуры 2ИА-6 с помощью "
                                  "встроенного контроля",
        'sis77c': "Т.К. 077.30.00q: Проверка внешнего состояния изделий аппаратуры ИВ-500E",
        'sis77d': "Т.К. 077.30.00m: Проверка аппаратуры встроенным контролем ИВ-500E",
        'sis84a': "Т.К. 84.10.00ж: Снимите, осмотрите и промойте маслофильтр главного редуктора.",
        'sis84b': "Т.К. 84.10.00д: Осмотрите главный редуктор, проверьте его крепление к "
                                  "редукторной раме и рамы к фюзеляжу. Убедитесь в исправности контровки и "
                                  "герметичности соединений редуктора, агрегатов и трубопроводов, подсоединенных "
                                  "к нему.",
        'sis84c': "Т.К. 84.11.00a: Осмотрите узлы подредукторной рамы (нижние и верхние) по всем "
                                  "проушинам и кольцевой сварке труб с узлами. Убедитесь в отсутствии трещин.",
        'sis84d': "Т.К. 84.10.00и: Снимите, осмотрите и промойте пробки-сигнализаторы ПС-1 (ФСС-1 и"
                                  "магнитные пробки).",
        'sis84e': "Т.К. 084.21.00a: Осмотрите промежуточный редуктор.",
        'sis84f': "Т.К. 084.21.00b: Проверьте уровень масла в промежуточном редукторе",
        'sis84g': "Т.К. 084.21.00c: Осмотрите и промойте сигнализаторы стружки промежуточного "
                                  "редуктора",
        'sis84h': "Т.К. 084.31.00a: Осмотрите хвостовой редуктор",
        'sis84j': "Т.К. 084.31.00В: Проверьте уровень масла в хвостовом редукторе",
        'sis84k': "Т.К. 084.31.00c: Осмотрите и промойте сигнализаторы стружки хвостового редуктора",
        'sis84t': "Т.К. 084.41.00А: Осмотрите хвостовой вал",
        'sis84s': "Т.К. 084.41.00С: Проверьте биение, излом и боковой зазор в шлицевых соединениях "
                                  "хвостового вала.",
        'sis84a1xx': "Т.К. 084.11.00b: Выполните проверку моментов затяжки гаек болтов крепления "
                                     "редукторной рамы к фюзеляжу;",
        'sis84b1xx': "Т.К. 084.11.00с: Выполните проверку моментов затяжки гаек болтов крепления"
                                     " подкосов редукторной рамы к лапам редуктора и прицепных подкосов к "
                                     "основным;",
        'sis110a': "Т.К. 110.40.00а:Проверьте функционирование радиовысотомера А-037 (РВ-3).",
        'sis110b': "Т.К. 110.10.00d: Проверьте крепление и состояние обтекателя антенны АН "
                                   "радиокомпаса АРК-15М",
        'sis110c': "Т.К. 110.10.00e: Осмотрите внешнее состояние, проверьте крепление и амортизацию"
                                   "блоков, затяжку и контровку накидных гаек разъемов, состояние и крепление "
                                   "кабелей радиокомпаса АРК-15М.",
        'sis110d': "Т.К. 110.21.00d: Проверьте внешнее состояние пульта изделия TSS.",
        'sis110e': "Т.К. 110.60.01с: Проверьте внешнее состояние панели (пульта) управления "
                                   "системы TTA-12H.",
        'sis110f': "Т.К. 110.61.00c: Проверьте внешнее состояние многофункционального "
                                   "индикатора TDS-56D.",
        'sis110g': "Т.К. 110.73.00f: Осмотрите радиопрозрачный обтекатель антенны метеолокатора "
                                   "1А813М.",
        'sis110h': "Т.К. 110.73.00с: Проверьте внешнее состояние метеолокатора 1А813М.",
        'sis110j': "Т.К. 110.73.00d: Проверьте состояние и отбортовки кабельного разветвителя, "
                                   "состояние перемычек металлизации кабелей и блоков метеолокатора 1А813М.",
        'sis110k': "Т.К. 110.10.00a: Проверьте функционирование радиокомпаса АРК-15М.",
        'sis110l': "Т.К. 110.21.00с: Проверьте функционирование аппаратуры TSS.",
        'sis110q': "Т.К. 110.60.01d: Проверьте функционирование системы ТТА-12Н со встроенным "
                                   "контролем.",
        'sis110w': "Т.К. 110.61.00d: Проверьте функционирование индикатора TDS-56D.",
        'sis110r': "Т.К. 110.73.00е: Проверьте работоспособность метеолокатора 1А813М.",
        'sis113a': "Т.К. 113.30.00а: Проверьте внешнее состояние и крепление ответчика СО-2010.",
        'sis113b': "Т.К. 113.30.00b: Проверьте работоспособность ответчика СО-2010 ВСК",
        'sis117a': "Т.К. 117.10.00a: Выполните проверку внешнего вида УБС-К.",
        'sis117b': "Т.К. 117.10.00b: Проверьте работоспособность УБС-К.",
        'sis129a': "Т.К. 129.20.00b: Осмотрите электрожгуты, пульты управления в кабине экипажа, "
                                   "кожухи и кассеты ЭКСР-46.",
        'sis129b':  "Т.К. 129.20.00a: Проверьте кассеты ЭКСР-46 под током при помощи приспособления.",
        'sis131a': "Т.К. 131.11.00 в: Осмотрите распределительную кробку вертолётного медицинского"
                                       " модуля ММВ.9520.000-03 (04)..",
        'sis131b': "Т.К. 131.11.00 б п.2: Проверьте внешнее состояние электрических соединителей и "
                                       "жгутов подключения модулей ММВ.",
        'sis131c': "Т.К. 131.11.00 б п.3: Проверьте внешнее состояние предохранителей и минусовых"
                                       " проводов в цепи питания ММВ.",
        'sis131d': "Т.К. 131.11.00 д: Проверьте систему электроснабжения ММВ от генератора"
                                       " вспомогательной силовой установки и от основных генераторов ГТ40-ПЧ8В..",



    }

    # Проверяем, является ли задача группой задач
    if task_type in descriptions_dict:
        return descriptions_dict[task_type]
    else:
        return "Описание не найдено"




@bot.message_handler(commands=['clear'])
def clear(message):
    if message.chat.id == channel_id:
        db.cur.execute("UPDATE tasks SET state = 'available', user_id = null")
        db.db.commit()
        bot.send_message(message.chat.id, "Задания возвращены в исходное положение")

@bot.message_handler(content_types=['document'])
def handle_document(message):
    if message.document.mime_type == 'application/pdf':
        document_id = message.document.file_id
        bot.send_message(message.chat.id, f'ID PDF файла: {document_id}')
    else:
        bot.send_message(message.chat.id, 'Пожалуйста, отправьте PDF файл.')

command_descriptions = {
    '/pass': 'Изменить пароль в боте',
    '/tasks': 'Показать начатые задачи.',
    '/progress': 'Показать процесс выполнения',
    '/clear': 'Очистить задания (только для определенного канала)'
}
@bot.message_handler(commands=['menu'])
def send_menu(message):
    if message.chat.id == channel_id:
        markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
        menu = types.KeyboardButton("Меню", callback_data='/menu')
        markup.add(menu)

        # Создаем инлайн-кнопки для каждой команды с описанием
        for command, description in command_descriptions.items():
            button = types.KeyboardButton(f"{command}: {description}", callback_data=command)
            markup.add(button)

        bot.send_message(message.chat.id, "Выберите нужную команду:", reply_markup=markup)

@bot.callback_query_handler(func=lambda call: call.data in command_descriptions.keys())
def handle_command(call):
    command = call.data

    # Обрабатываем каждую команду
    if command == '/pass':
        bot.send_message(call.message.chat.id, "Изменить пароль в боте")

    elif command == '/tasks':
        bot.send_message(call.message.chat.id, "Показать начатые задачи.")

    elif command == '/progress':
        bot.send_message(call.message.chat.id, "Показать процесс выполнения")

    elif command == '/clear':
        if call.message.chat.id == channel_id:
            # Здесь можете добавить код для выполнения команды /clear
            db.cur.execute("UPDATE tasks SET state = 'available', user_id = NULL")
            db.db.commit()
            bot.send_message(call.message.chat.id, "Задания возвращены в исходное состояние.")
        else:
            bot.send_message(call.message.chat.id, "Команда /clear доступна только в определенном канале.")

    # Отправляем ответ на нажатие кнопки
    bot.answer_callback_query(call.id, text=f"Вы выбрали команду: {command}")


@bot.message_handler(commands=['start'])
def start(message):
    markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
    item2 = types.KeyboardButton("Ввести пароль")
    markup.add(item2)
    bot.send_message(message.chat.id, f"Привет, {message.from_user.first_name}! Нажмите кнопку ввести пароль", reply_markup=markup)

@bot.message_handler(func=lambda message: message.text == "Ввести пароль")
def login(message):
    bot.send_message(message.chat.id, "Введите пароль для входа:")
    bot.register_next_step_handler(message, authenticate)

def authenticate(message):
    password = message.text
    if password == STATIC_PASSWORD:
        markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
        item1 = types.KeyboardButton("Ф-2")
        markup.add(item1)
        bot.send_message(message.chat.id, f"Пароль верный! Можете приступать к выполнению формы.", reply_markup=markup)
    else:
        bot.send_message(message.chat.id, "Неверный пароль. Попробуйте еще раз.")

@bot.message_handler(func=lambda message: message.text == "Ф-2")
def handle_f1(message):
    markup = types.InlineKeyboardMarkup(row_width=2)
    AiREO = types.InlineKeyboardButton("АиРЭО", callback_data='AiREO')
    PiD = types.InlineKeyboardButton("ПиД", callback_data='PiD')
    markup.add(AiREO, PiD)
    bot.send_message(message.chat.id, "Теперь вы можете приступать к выполнении формы Ф-2 "
                                      "Выбирите свою специальность", reply_markup=markup)


@bot.callback_query_handler(func=lambda call: call.data in ['PiD', 'AiREO'])
def handle_pid_button(call):
    if call.data == 'PiD':
        markup = types.InlineKeyboardMarkup(row_width=8)
        sis01 = types.InlineKeyboardButton("09", callback_data='sis09')
        sis02 = types.InlineKeyboardButton("10", callback_data='sis10')
        sis03 = types.InlineKeyboardButton("12", callback_data='sis12')
        sis04 = types.InlineKeyboardButton("21", callback_data='sis21g')
        sis05 = types.InlineKeyboardButton("26", callback_data='sis26')
        sis06 = types.InlineKeyboardButton("28", callback_data='sis28a')
        sis07 = types.InlineKeyboardButton("29", callback_data='sis29q')
        sis08 = types.InlineKeyboardButton("32", callback_data='sis32')
        sis09 = types.InlineKeyboardButton("36", callback_data='sis36')
        sis53 = types.InlineKeyboardButton("53", callback_data='sis53')
        sis10 = types.InlineKeyboardButton("65", callback_data='sis65')
        sis11 = types.InlineKeyboardButton("71", callback_data='sis71')
        sis12 = types.InlineKeyboardButton("72", callback_data='sis72')
        sis13 = types.InlineKeyboardButton("73", callback_data='sis73')
        sis14 = types.InlineKeyboardButton("78", callback_data='sis78')
        sis15 = types.InlineKeyboardButton("80", callback_data='sis80')
        sis16 = types.InlineKeyboardButton("84", callback_data='sis84')
        sis17 = types.InlineKeyboardButton("131", callback_data='sis131a')
        sis18 = types.InlineKeyboardButton("148", callback_data='sis148')
        sis19 = types.InlineKeyboardButton("Карта смазки", callback_data='Lubricaticon')
        sis20 = types.InlineKeyboardButton("Заключительные работы", callback_data='Finish work')
        markup.add(sis01, sis02, sis03, sis04, sis05, sis06)
        markup.add(sis07, sis08, sis09, sis53, sis10, sis11, sis12)
        markup.add(sis13, sis14, sis15, sis16, sis17, sis18)
        markup.add(  sis19, sis20)
        bot.send_message(call.message.chat.id, "Выберете систему для ТО Ф-2 по ПиД", reply_markup=markup)

    elif call.data == 'AiREO':
        markup = types.InlineKeyboardMarkup(row_width=3)
        sis21 = types.InlineKeyboardButton("21", callback_data='sis21')
        sis23 = types.InlineKeyboardButton("23", callback_data='sis23')
        sis24 = types.InlineKeyboardButton("24", callback_data='sis24')
        sis26 = types.InlineKeyboardButton("26", callback_data='sis26a')
        sis28 = types.InlineKeyboardButton("28", callback_data='sis28')
        sis29 = types.InlineKeyboardButton("29", callback_data='sis29')
        sis30 = types.InlineKeyboardButton("30", callback_data='sis30')
        sis31 = types.InlineKeyboardButton("31", callback_data='sis31')
        sis33 = types.InlineKeyboardButton("33", callback_data='sis33')
        sis34 = types.InlineKeyboardButton("34", callback_data='sis34')
        sis49 = types.InlineKeyboardButton("49", callback_data='sis49')
        sis65 = types.InlineKeyboardButton("65", callback_data='sis65a')
        sis72 = types.InlineKeyboardButton("72", callback_data='sis72a')
        sis73 = types.InlineKeyboardButton("73", callback_data='sis73a')
        sis77 = types.InlineKeyboardButton("77", callback_data='sis77')
        sis110 = types.InlineKeyboardButton("110", callback_data='sis110')
        sis113 = types.InlineKeyboardButton("113", callback_data='sis113')
        sis117 = types.InlineKeyboardButton("117", callback_data='sis117')
        sis129 = types.InlineKeyboardButton("129", callback_data='sis129')
        sis131 = types.InlineKeyboardButton("131", callback_data='sis131')
        sis142 = types.InlineKeyboardButton("142", callback_data='sis142')
        markup.add(sis21, sis23, sis24, sis26, sis28)
        markup.add(sis29, sis30, sis31, sis33, sis34)
        markup.add( sis49,  sis65, sis72, sis73, sis77)
        markup.add( sis110, sis113, sis117, sis129, sis131)
        markup.add(sis142)
        bot.send_message(call.message.chat.id,"Выберете систему для ТО Ф-2 по АиРЭО ", reply_markup=markup)


@bot.callback_query_handler(
    func=lambda call: call.data in ['sis09', 'sis10', 'sis12', 'sis21g', 'sis26', 'sis28a', 'sis29q','sis32', 'sis36',
                                    'sis53', 'sis65', 'sis71', 'sis72', 'sis73', 'sis78', 'sis80', 'sis84', 'sis148',
                                    'sis131a', 'Lubricaticon', 'Finish work',

                                    'sis21', 'sis23', 'sis24', 'sis28', 'sis26a', 'sis29', 'sis30', 'sis31', 'sis33',
                                    'sis34', 'sis49', 'sis65a', 'sis72a', 'sis73a', 'sis77', 'sis110', 'sis113',
                                    'sis117', 'sis129', 'sis131', 'sis142'])
def handle_task_sis(call):
    descriptions = {
        'sis09': {"description": "Т.К. 009.00.00: Буксировка ВС",
                  "document_id": 'BQACAgIAAxkBAAMMZmg8m6XdEL6OVBZU1vKd_R29KO8AAjRMAAIk6klLdvpqybjGDc01BA'},
        'sis10': {"description": "Т.К. 010.10.00: Установите упорные колодки под колеса основных опор под колеса, "
                  "заземлите вертолет",
                  "document_id": 'BQACAgIAAxkBAAMOZmg9QjPkVd-FrbzIs3vGSuRJLHYAAkFMAAIk6klLr_sd0lhtFZ01BA'},
        'sis12': {"description": "Т.К. 012.10.00: Подготовьте наземное оборудование, необходимое для технического "
                  "обслуживания",
                  "document_id": 'BQACAgIAAxkBAAMQZmg9lKoKjGpFIATJiNBLhSEIxO0AAklMAAIk6klLHHpRBpWtbP01BA'},
        'sis21g': {"description": "Т.К. 021.40.00g: Проверьте состояние свечного уздла обогревателя Ко-50",
                   "document_id": 'BQACAgIAAxkBAAIBWWZwGXCO1d_1NRf7_fY5CwP_ioGIAAK1TQACwLqJS5DkMBTFqQAB7zUE'},
        'sis26': {"description":  "Т.К. 026.20.00a: Проверте состояние баллонов, трубопроводов и распылителей"
                                  " пожаротушения",
                  "document_id": 'BQACAgIAAxkBAAMUZmg-AAGjozLUdIbfJucL-eNGiFnsAAJNTAACJOpJS9eMOVdVgXPTNQQ'},
        'sis80': {"description": "080.12.00 TK 203: Снимите, осмотрите и промойте фильтр воздушного стартера.",
                  "document_id": 'BQACAgIAAxkBAAPDZm8MQwpzGtsbUdHM_cSCoph9maIAAstKAAKmKHhLjTO8FbenIv01BA'},
        'sis148': {"description": "Т.К. 148.10.00а: Осмотрите систему воздушного охлаждения агрегатов. Убедитесь в "
                                  "надежности крепления агрегатов и исправности контровки.",
                   "document_id": 'BQACAgIAAxkBAAPPZm8TQE_KykRWW7p6hsohXvp0v_QAAk1LAAKmKHhLCjWnL9-zVq41BA'},
        'Lubricaticon': {"description": "Карта смазки",
                         "document_id": 'BQACAgIAAxkBAAPVZm8VTzjkMAR7uI0bq4vTdszIcOQAAm5LAAKmKHhLiVYtYyTJ8cI1BA'},
        'Finish work': {"description": "Заключительные работы",
                        "document_id": 'BQACAgIAAxkBAAPTZm8VHowb06aj1ij_RCoH4R6S0IAAAm1LAAKmKHhLrKf0XNqCHfQ1BA'}
    }
    if descriptions.get(call.data):
        task_type = call.data  # Set task_type based on the callback data
        markup = types.InlineKeyboardMarkup()
        start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_type}')
        markup.add(start_button)
        document_id = descriptions[call.data]['document_id']
        bot.send_document(call.message.chat.id, document_id, caption=descriptions[call.data]['description'],
                          reply_markup=markup)

    if call.data == 'sis28a':
        descriptions_28 = {
            'sis28g': {"description": "Т.К. 028.20.00a: Осмотр и проверка состояния и крепления агрегатов, "
                                      "трубопроводов, шлангов топливной системы (с учетом установки ДПТБ), "
                                      "конденсаторов К50",
                       "document_id": 'BQACAgIAAxkBAAMWZmg-VcjKTSc3SefY9IkgTQeQWAIAAk5MAAIk6klL-51zPX2k4X41BA'},
            'sis28h': {"description": "Т.К. 028.20.00e: Осмотр и проверка состояния и крепления топливного насоса 463Б "
                                      "и электромагнитного крана 610200А обогревателя КО-50",
                       "document_id": 'BQACAgIAAxkBAAMYZmg-vTqrZhyN_9bzZNSkHLFvGHcAAlZMAAIk6klLBpz3WqXY6Kg1BA'},
            'sis28j': {"description": "Т.К. 028.70.00g: Проверка момента затяжки гаек стяжных тросов крепления "
                                      "дополнительных подвесных топливных баков (ДПТБ)",
                       "document_id": 'BQACAgIAAxkBAAMaZmg_AzvDkyVMCVd_7DHX06vENLUAAlxMAAIk6klLYXrryv7NPsM1BA'},
        }
        for task_key, task_data in descriptions_28.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)

    if call.data == 'sis29q':
        descriptions_29 = {
            'sis29b': {"description": "Т.К. 029.10.00e: Проверьте зарядку гидроаккумуляторов",
                       "document_id": 'BQACAgIAAxkBAAMcZmg_teIxs2M5mz_AK_Bxj_kbV9sAAnJMAAIk6klL0lnLnashm0k1BA'},
            'sis29c': {"description": "Т.К. 029.10.00o: Проверка и промывка фильтров ФГ11БН и 8Д2.966.017-2",
                       "document_id": 'BQACAgIAAxkBAAMeZmhAARQNS79JZsMtfChnDBLJmLQAAnxMAAIk6klLOOlQUgfVEBs1BA'},

        }
        for task_key, task_data in descriptions_29.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)

    if call.data == 'sis32':
        descriptions_32 = {
            'sis32a': {"description": "Т.К. 032.10.00c: Проверка зазора в микровыключателях АМ-800К механизмов"
                                      " включения гидроупоров",
                       "document_id": 'BQACAgIAAxkBAAMgZmhATbxkNUYdLcfNAjciwUhGnswAAn9MAAIk6klLMMTyHrMbl6Q1BA'},
            'sis32b': {"description": "Т.К. 032.41.00a: Осмотр корпуса дискового тормоза и блока цилиндров",
                       "document_id": 'BQACAgIAAxkBAAMiZmhAqpd4aeTumVqjcabAjF8bQSIAAoNMAAIk6klLure4RuhChsY1BA'},
            'sis32c': {"description": "Т.К. 032.41.00b: Проверьте работоспособность тормозных колес основных "
                                      "опор шасси",
                       "document_id": 'BQACAgIAAxkBAAMkZmhBRKsyGbJHpSG_dyxO0_GHGIAAAotMAAIk6klLeuCWL37Lws81BA'},

        }
        for task_key, task_data in descriptions_32.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)

    if call.data == 'sis36':
        descriptions_36 = {
            'sis36a': {"description": "Т.К. 036.10.00b: Проверка состояния агрегатов и трубопроводов "
                                      "пневматической системы",
                       "document_id": 'BQACAgIAAxkBAAMmZmhYlNS9kXOGw8uj74Zo_HBFMqMAAhlOAAIk6klLMS_MFRzcouU1BA'},
            'sis36b': {"description": "Т.К. 036.10.00f: Осмотр и замена фильтра компрессора АК-50Т1",
                       "document_id": 'BQACAgIAAxkBAAMoZmhY0XWGQ2KFj4vkMMHcfGNpYm4AAhxOAAIk6klLmV0U6eqzsgABNQQ'},

        }
        for task_key, task_data in descriptions_36.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)

    if call.data == 'sis53':
        descriptions_53 = {
            'sis53a': {"description": "Т.К. 053.10.00а: Осмотрите изнутри каркас хвостовой балки, болты стыковки"
                                      " хвостовой балки с фюзеляжем и концевой балкой. Убедитесь в отсутствии "
                                      "трещин на уголках и кницах, ослаблении заклепок и болтовых соединений "
                                      "пневматической системы",
                       "document_id": 'BQACAgIAAxkBAAMqZmhZC4Z4dVm5hT0B2is1B7pVpvUAAh9OAAIk6klLOgqKpB0y1QI1BA'},
            'sis53b': {"description": "Т.К. 053.10.00ɡ: Осмотрите изнутри грузовой кабины шп. №7 и №10 ЦЧФ в зоне"
                                      " крепления узлов основных опор вертолета.",
                       "document_id": 'BQACAgIAAxkBAAMsZmhap1SFC5Szb7th3-KBnzsSl4gAAjVOAAIk6klLbpA2QG3HSDo1BA'},
            'sis53c': {"description": "Т.К. 053.40.00с: Осмотрите фитинги и опоры хвостового вала трансмиссии,"
                                      " кронштейны для колодок под тросы управления рулевым винтом.",
                       "document_id": 'BQACAgIAAxkBAAMuZmhbDXmJ1Hg2Y_be4Th2CUGoqZwAAjtOAAIk6klLu2USe62HPXQ1BA'},
                    }
        for task_key, task_data in descriptions_53.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)
    if call.data == 'sis65':
        descriptions_65 = {
            'sis65a': {"description": "Т.К. 065.10.00j: Осмотрите ЛНВ.Убедитесь в отсутствии механических повреждений,"
                                      " вспучивания и отставания обшивки, оковок, резиновых накладок, растрескивания "
                                      "и выкрашивания герметика в стыках хвостовых отсеков.",
                       "document_id": 'BQACAgIAAxkBAAMwZmhdTdJZHoyfPVGp617f4eE9yA0AAltOAAIk6klLpBpMoT6r4001BA'},
            'sis65b': {"description": "Т.К. 065.10.00k: Осмотрите проушины комлевых наконечников и их пластины в "
                                      "местах установки болтов, проверьте контровку гаек болтов крепления лопастей к "
                                      "втулке несущего винта. Проверьте по меткам затяжку винтов концевых обтекателей.",
                       "document_id": 'BQACAgIAAxkBAAMyZmheMm8-cWlc7frLK_nWo10qe20AAmhOAAIk6klLi4eB5veKdus1BA'},
            'sis65c': {"description": "Т.К. 065.12.00c: Осмотрите состояние гасителя вибрации.",
                       "document_id": 'BQACAgIAAxkBAAM0Zmhem8mv8wravmrnEGcsxnfLVN8AAnBOAAIk6klLbXeZEnrSG8M1BA'},
            'sis65d': {"description": "065.10.00r: Снимите и осмотрите магнитные пробки осевых шарниров втулки несущего"
                                      " винта.",
                       "document_id": 'BQACAgIAAxkBAAM2ZmhfK_jtOeDhlpWCbOx08-98uZ4AAoJOAAIk6klLRekMfVmT3Rs1BA'},
            'sis65e': {"description": "065.20.00i: Осмотрите лопасти рулевого винта и проверьте простукиванием и на"
                                      " ощупь состояние приклейки обшивки хвостовых отсеков, нагревательных накладок,"
                                      "резиновых накладок и оковок..",
                       "document_id": 'BQACAgIAAxkBAAM4Zmhfs4JUrz5aHE-4g6u6cU1jTgcAAopOAAIk6klLP8nTIydcj241BA'},
            'sis65f': {"description": "065.20.00m: Замерьте осевой люфт подшипника штока рулевого винта."
                                      "Люфт = ______________ мм",
                       "document_id": 'BQACAgIAAxkBAAM6Zmhgess7_w9ubTqq0Gl_fH-MI2kAApZOAAIk6klL7XnoRTXw1Qo1BA'},
            'sis65g': {"description": "065.20.00n: Замерьте люфт валиков и вилок рычагов поворота лопастей."
                                      "в плоскости тяги №1= №2= №3="
                                      "в плоскости вращ. №1= №2= №3="
                                      "осевой люфт вилок №1= №2= №3=",
                       "document_id": 'BQACAgIAAxkBAAM-ZmhiMXVwDJJ7gsNzJANxP2s76T4AAqdOAAIk6klLD_yYLB9okiQ1BA'},
            'sis65r': {"description": "065.20.00с: Проверьте работу шарниров втулки рулевого винта",
                       "document_id": 'BQACAgIAAxkBAANAZmhism1_2gI0n_SnwnEgnnmYsWoAAqpOAAIk6klLm4RPDTeZYFI1BA'},
            'sis65h': {"description": "065.40.00е,f: Осмотрите тяги, кронштейны, рычаги и качалки всех цепей управления."
                                      "Убедитесь, что на них нет механических повреждений. Убедитесь в надежности всех "
                                      "соединений, в  наличии и исправности контровки болтовых соединений.",
                       "document_id": 'BQACAgIAAxkBAANCZmhrQQJw9t-DQgF_wGUDAlvClt4AAkpPAAIk6klLWneDZvbR2gU1BA'},
            'sis65j': {"description": "065.40.00с: Проверьте работоспособность электромеханизма МП-100М в системе "
                                      "перенастройки оборотов двигателей.",
                       "document_id": 'BQACAgIAAxkBAANEZmhr5GA3H3c0TyncNPyBj4w5LPgAAlNPAAIk6klLSs_n7f0p0fs1BA'},
            'sis65k': {"description": "065.40.00i: Проверьте регулировку микровыключателя механизма подвижного "
                                      "упора системы СПУУ-52-1.",
                       "document_id": 'BQACAgIAAxkBAANGZmhsbepgMHsn7n2G6ugpQYcatR0AAmVPAAIk6klLhsJWJhCtb9Q1BA'},
            'sis65x': {"description": "065.40.00δ(кроме п.3): Осмотрите кронштейн крепления гидроусилителей."
                                      " Убедитесь в отсутствии трещин на кронштейне. Проверьте крепление кронштейна к "
                                      "главному редуктору и опор агрегатов управления к кронштейну.",
                       "document_id": 'BQACAgIAAxkBAANIZmhwgrFIG8ochrgqlBrMlDqku-4AAp5PAAIk6klL63gwXzSA8hI1BA'},
            'sis65a1xx': {"description": "065.10.00f: Выполните проверку момента затяжки гайки крепления "
                                         "втулки несущего винта на валу главного редуктора;",
                          "document_id": 'BQACAgIAAxkBAAICi2Z5ZXLEaFgJsHrxRxez2j3ZLgSUAAJkTAAC2kXIS2WU9N8U2QWsNQQ'},
            'sis65b1xx': {"description": "065.10.00е: Выполните проверку момента затяжки болтов крепления рычагов "
                                         "поворота лопастей и гаек болтов крепления кронштейнов гидродемпферов к "
                                         "цапфам осевых шарниров;",
                          "document_id": 'BQACAgIAAxkBAAICjWZ5ZlvDomT5YhxSCdfuh5KB3s8-AAJvTAAC2kXIS8EdAzGOydiyNQQ'},
            'sis65d1xx': {"description": "065.20.00d: Выполните проверку моментов затяжки гаек болтов крепления втулки "
                                         "рулевого винта к фланцу вала хвостового редуктора.;",
                          "document_id": 'BQACAgIAAxkBAAICp2Z5a3zOZvpA4AIHi6q9Xb8pwPYoAALITAAC2kXISwI8Qj8E6rhJNQQ'},

        }
        for task_key, task_data in descriptions_65.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)

    if call.data == 'sis71':
        descriptions_71 = {
            'sis71a': {"description": "Т.К. 071.00.00a: Осмотр патрубков из КПВ ТВ3-117ВМ",
                       "document_id": 'BQACAgIAAxkBAANyZmh2gX3im6xxTgaVWktS3pbt99EAAu1PAAIk6klLtXeGnbdRieA1BA'},
            'sis71b': {"description": "Т.К.071.00.00b: Слейте конденсат из влагоотстойника системы синхронизации "
                                      "мощности двигателей ТВ3-117ВМ.",
                       "document_id": 'BQACAgIAAxkBAAN0Zmh3aaYzlBzxYzudk0ERiBOvvVYAAvtPAAIk6klLbz2L0rhAqPc1BA'},
            'sis71d': {"description": "Т.К. 071.60.00а: Осмотрите ПЗУ двигателей.",
                       "document_id": 'BQACAgIAAxkBAAN2Zmh38qFNlqv04JuPVvBFtmLvs6AAAgJQAAIk6klLkpZlB1eNB801BA'},
            'sis71c': {"description": "Т.К. 071.60.00а,п. 1-5,9: Демонтируйте обтекатели левого и правогодвигателя.",
                       "document_id": 'BQACAgIAAxkBAAN2Zmh38qFNlqv04JuPVvBFtmLvs6AAAgJQAAIk6klLkpZlB1eNB801BA'},
            'sis71e': {"description": "Т.К. 071.60.00d: Осмотрите сепараторы ПЗУ двигателей.",
                       "document_id": 'BQACAgIAAxkBAAOEZml2Aloc2rfGb72UVXLp7jAtMUIAAnpPAAI3zFBLg93XcSRHH081BA'},
            'sis71f': {"description": "Т.К. 071.60.00d: Осмотрите поворотный патрубок и раструб вывода пыли "
                                      "ПЗУ двигателей.",
                       "document_id": 'BQACAgIAAxkBAAOGZml2gJVrTqvY47Vaxb3G5o75q8gAAoBPAAI3zFBLE7McIaPOOBc1BA'},
            'sis71g': {"description": "Т.К. 071.60.00 п. 8, 10: Установите обтекатели ПЗУ." ,
                       "document_id": 'BQACAgIAAxkBAAOGZml2gJVrTqvY47Vaxb3G5o75q8gAAoBPAAI3zFBLE7McIaPOOBc1BA'},
            'sis71h': {"description": "Т.К. 071.60.00с: Проверьте работу ПЗУ в режиме пылеочистки.",
                       "document_id": 'BQACAgIAAxkBAAOIZml3Zt3uc4antGbS18mRk6fD9hwAAo9PAAI3zFBLY0hOw3lfr0U1BA'},

        }
        for task_key, task_data in descriptions_71.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)
    if call.data == 'sis72':
        descriptions_72 = {
            'sis72a': {"description": "072.00.00 TK 601,603: Наружный осмотр двигателей",
                       "document_id": 'BQACAgIAAxkBAAOKZml4vNdoSq_HFT6nGmqsAh6YFoIAAp1PAAI3zFBLuxmhKjMdTwk1BA'},
            'sis72b': {"description": "072.00.00 TK 705: Очистка проточной части двигателя",
                       "document_id": 'BQACAgIAAxkBAAOMZml5DqqNd7Z4KmapVXI-9lhbxNcAAqBPAAI3zFBL6Asoi2V2hVk1BA'},
            'sis72i': {"description": "072.00.00 TK ТК 603: Осмотрите воздухопроводы системы запуска двигателей "
                                      "ТВ3-117ВМ, убедитесь в их исправности и надежности крепления.",
                       "document_id": 'BQACAgIAAxkBAAOSZmmJXNrRupbC-Zj8sGFLsi6acKsAAohQAAI3zFBLMDtC1DpLpRo1BA'},
            'sis72g': {"description": "072.00.00 TK ТК 606: Проверьте соосность двигателя с главным редуктором.",
                       "document_id": 'BQACAgIAAxkBAAOUZmmKWpLHcB9GdJDNAWSwAAGGHLZ2AAKUUAACN8xQSwI8OCo5OTNyNQQ'},

            'sis72c': {"description": "Т.К. 072.30.00 TK 201: Проверьте положение стрелок лимбов направляющих аппаратов"
                                      " компрессора. (Стрелки должны находиться на угле 27+1,5°.)",
                       "document_id": 'BQACAgIAAxkBAAOOZml6B7BLCLSnb9sDsGg1yFR2_lkAAqpPAAI3zFBLKZ0S7a3pSr81BA'},
            'sis72d': {"description": "Т.К. 072.30.00 TK 201: Проверьте положение стрелок лимбов направляющих аппаратов"
                                      " компрессора. (Стрелки должны находиться на угле 27+1,5°.)",
                       "document_id": 'BQACAgIAAxkBAAOOZml6B7BLCLSnb9sDsGg1yFR2_lkAAqpPAAI3zFBLKZ0S7a3pSr81BA'},
            'sis72e': {"description": "Т.К. 072.30.00 TK 201: Осмотрите входные каналы двигателей, лопатки ВНА,"
                                      " лопатки первой ступени компрессора, убедитесь в отсутствии посторонних "
                                      "предметов, чистоте каналов, ослабления заклепок, механических повреждений,"
                                      " эрозионного износа и течи масла из первых опор двигателей."
                                      " компрессора. (Стрелки должны находиться на угле 27+1,5°.)",
                       "document_id": 'BQACAgIAAxkBAAOOZml6B7BLCLSnb9sDsGg1yFR2_lkAAqpPAAI3zFBLKZ0S7a3pSr81BA'},
            'sis72f': {"description": "Т.К. 072.30.00 TK 202: При снятом обтекателе произведите замер износа рабочих"
                                      " лопаток первой ступени ротора компрессора)",
                       "document_id": 'BQACAgIAAxkBAAOQZmmH0PHJRZYSJS36aR96vWamph0AAnFQAAI3zFBLqTLrt4SJyWI1BA'},
            'sis72h': {"description": "Т.К. 072.90.00 TK 204: Снимите, осмотрите и промойте защитный фильтр в "
                                      "трубопроводе отвода масла из четвертой и пятой опор.)",
                       "document_id": 'BQACAgIAAxkBAAOWZmmK8AnhYeGanS8HqKO-LcUDazQAAplQAAI3zFBLJJwcYrXlu-g1BA'},
            'sis72j': {"description": "Т.К. 072.90.02 TK ТК 201,202: Снимите, осмотрите и промойте масляный фильтр.)",
                       "document_id": 'BQACAgIAAxkBAAOYZmmPRqCB0yZFLaN3syeUGcr2v50AArBQAAI3zFBLT-XtF-ZRW3s1BA'},
            'sis72k': {"description": "Т.К. 072.90.13 TK ТК 201: Снимите, осмотрите, промойте и проверьте "
                                      "срабатывание сигнализатора стружки..)",
                       "document_id": 'BQACAgIAAxkBAAOaZmmQR2qmhdseeI7FrWTTvIWtE-oAArlQAAI3zFBL6DqodIdL3PU1BA'},
            'sis72l': {"description": "Т.К. 072.00.00 ТК 507, 603: Запустите, прогрейте и опробуйте двигатель. "
                                      "срабатывание сигнализатора стружки..)",
                       "document_id": 'BQACAgIAAxkBAAPBZm8KpiRCrfoO8iiwa9NHJ8Vd17wAArVKAAKmKHhLGRgXAnBWEcY1BA'},
            'sis72q': {"description": "Т.К. 072.00.00 ТК 507, 603: После пробы проверьте герметичность "
                                      "соединений по разъемам:"
                                      "- масляных фильтров;"
                                      "- топливных фильтров;"
                                      "- топливных фильтров насосов-регуляторов.",
                       "document_id": 'BQACAgIAAxkBAAPBZm8KpiRCrfoO8iiwa9NHJ8Vd17wAArVKAAKmKHhLGRgXAnBWEcY1BA'},

        }
        for task_key, task_data in descriptions_72.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)
    if call.data == 'sis73':
        descriptions_73 = {
            'sis73a': {"description": "Т.К. 073.02.00 TK 202: Прочистите жиклерное отверстие эжектора с продувкой"
                                      " воздушного трубопровода.",
                       "document_id": 'BQACAgIAAxkBAAOcZmmoKXbEpT5EuiFjmzeyzTtyz5gAAsJRAAI3zFBL86OD31WKLEI1BA'},
            'sis73b': {"description": "Т.К. 073.11.04 TK 205: Замените (осмотрите и промойте) фильтроэлемент топливного"
                                      " фильтра.",
                       "document_id": 'BQACAgIAAxkBAAOeZmmpRYY5ZqDNrnwAASeJoEyDB8SAAALOUQACN8xQS5x2yZLVDAivNQQ'},
            'sis73c': {"description": "Т.К. 073.12.05 TK 602: Снимите, осмотрите и промойте воздушный фильтр "
                                      "насоса-регулятора НР-3ВМ.",
                       "document_id": 'BQACAgIAAxkBAAOgZmmsNroDBKRvlp_UPAdoBigF63cAAuZRAAI3zFBLGz_HKqT3MFA1BA'},
            'sis73d': {"description": "Т.К. 073.12.05 TK 603: Снимите, осмотрите и прочистите воздушные жиклёры "
                                      "АЗ и АП с переходниками.",
                       "document_id": 'BQACAgIAAxkBAAOiZmmszjyZaD8PeUlBYc9acr2MgcwAAuhRAAI3zFBLhh11s5xhzc81BA'},
            'sis73e': {"description": "Т.К. 073.12.05 TK 604: Снимите, осмотрите и промойте топливные "
                                      "фильтры насоса-регулятора НР-3ВМ.",
                       "document_id": 'BQACAgIAAxkBAAOkZmm6NxxtBskbhozekx6VuUDinpEAAppSAAI3zFBLafFG1vDww6k1BA'},
            'sis73f': {"description": "Т.К. 073.12.05 ТК 303, п.1: Стравите воздух из топливной системы двигателей.",
                       "document_id": 'BQACAgIAAxkBAAO7Zm8GnDK1JQtb-YjDCl4zMgod4ewAAnxKAAKmKHhLYJEklzRVPzU1BA'},
            'sis73l': {"description": "Т.К. 073.12.05 ТК 303, п.1: Снимите, осмотрите и промойте топливный фильтр "
                                      "исполнительного механизма ИМ-3А..",
                       "document_id": 'BQACAgIAAxkBAAO9Zm8G1dAmRK3FwMAjw_JUWKv8nP4AAoBKAAKmKHhLfwlLvrD2Jk41BA'},

            }
        for task_key, task_data in descriptions_73.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)
    if call.data == 'sis78':
        descriptions_78 = {
            'sis78a': {"description": "Т.К. 078.00.00б, 072.58.00, ТК 204 : Проверьте затяжку хомута крепления "
                                      "выхлопного насадка двигателя.",
                       "document_id": 'BQACAgIAAxkBAAO_Zm8J8RD2OnhJOxq7Wq_n_j9VpTAAAqVKAAKmKHhLi2XSn1xOvS81BA'},
            }
        for task_key, task_data in descriptions_78.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)

    if call.data == 'sis84':
        descriptions_84 = {
            'sis84a': {"description": "Т.К. 084.10.00ж: Снимите, осмотрите и промойте маслофильтр главного редуктора.",
                       "document_id": 'BQACAgIAAxkBAAPFZm8QvcieXUBcwunBlFpacPMqrREAAhBLAAKmKHhLWayBN2unfoM1BA'},
            'sis84b': {"description": "Т.К. 084.10.00д: Осмотрите главный редуктор, проверьте его крепление к "
                                      "редукторной раме и рамы к фюзеляжу. Убедитесь в исправности контровки и "
                                      "герметичности соединений редуктора, агрегатов и трубопроводов, подсоединенных "
                                      "к нему.",
                       "document_id": 'BQACAgIAAxkBAAPHZm8RGHYf9we2-i2y4vrUVOFsz0IAAhdLAAKmKHhLEOcf9gUBYPs1BA'},
            'sis84c': {"description": "Т.К. 084.11.00a: Осмотрите узлы подредукторной рамы (нижние и верхние) по всем "
                                      "проушинам и кольцевой сварке труб с узлами. Убедитесь в отсутствии трещин.",
                       "document_id": 'BQACAgIAAxkBAAPJZm8RjdJQp2QC-70uGT3poPtSS5sAAhxLAAKmKHhLGwVKwWkPiYs1BA'},
            'sis84d': {"description": "Т.К. 084.10.00и: Снимите, осмотрите и промойте пробки-сигнализаторы ПС-1 "
                                      "(ФСС-1 и магнитные пробки).",
                       "document_id": 'BQACAgIAAxkBAAPNZm8R5uvJboz04uM-vKW0Uw4ZQq8AAiRLAAKmKHhLxE3uypvg7DE1BA'},
            'sis84e': {"description": "Т.К. 084.21.00a: Осмотрите промежуточный редуктор.",
                       "document_id": 'BQACAgIAAxkBAAICcGZ5WP_wkOSKhrIOrDq48pKxuYGSAAL2SwAC2kXIS2VQhz02ZvQGNQQ'},
            'sis84f': {"description": "Т.К. 084.21.00b: Проверьте уровень масла в промежуточном редукторе",
                       "document_id": 'BQACAgIAAxkBAAICcmZ5Wjs_HSoxsQNFdxwm2dTocZTZAAIDTAAC2kXISzMdEYDoYYDANQQ'},
            'sis84g': {"description": "Т.К. 084.21.00c: Осмотрите и промойте сигнализаторы стружки промежуточного "
                                      "редуктора",
                       "document_id": 'BQACAgIAAxkBAAICdGZ5WtrRlNM8RbDxIZ8yXVw6GkY_AAIETAAC2kXISx25Z99nJvqHNQQ'},
            'sis84h': {"description": "Т.К. 084.31.00a: Осмотрите хвостовой редуктор",
                       "document_id": 'BQACAgIAAxkBAAICdmZ5XagTbZyXjIfSTLr-zxK7zDgxAAIWTAAC2kXIS8OYMbkHIDC1NQQ'},
            'sis84j': {"description": "Т.К. 084.31.00В: Проверьте уровень масла в хвостовом редукторе",
                       "document_id": 'BQACAgIAAxkBAAICeGZ5XoXCOAAB8E_SGHNTosgGFonnogACHEwAAtpFyEtgv71phdrr7jUE'},
            'sis84k': {"description": "Т.К. 084.31.00c: Осмотрите и промойте сигнализаторы стружки хвостового редуктора",
                       "document_id": 'BQACAgIAAxkBAAICemZ5XuwoihINYNP_hsia8X1fwfayAAIiTAAC2kXIS29b5BXj7v8_NQQ'},
            'sis84t': {"description": "Т.К. 084.41.00А: Осмотрите хвостовой вал",
                       "document_id": 'QACAgIAAxkBAAICfGZ5X_3YBa2chsle2nI88CDt70IfAAItTAAC2kXISwSRI9_h5TA3NQQ'},
            'sis84s': {"description": "Т.К. 084.41.00С: Проверьте биение, излом и боковой зазор в шлицевых соединениях "
                                      "хвостового вала.",
                       "document_id": 'BQACAgIAAxkBAAICfmZ5YNP3VJL7ag5VITlTvQABXBfnSwACN0wAAtpFyEuH3ymMNCEQJzUE'},
            'sis84a1xx': {"description": "Т.К. 084.11.00b: Выполните проверку моментов затяжки гаек болтов крепления "
                                         "редукторной рамы к фюзеляжу;",
                          "document_id": 'BQACAgIAAxkBAAICj2Z5Z9Vipg45QBd3N0eiaLtJcYYnAAKDTAAC2kXISyuYXjj2KrFcNQQ'},
            'sis84b1xx': {"description": "Т.К. 084.11.00с: Выполните проверку моментов затяжки гаек болтов крепления"
                                         " подкосов редукторной рамы к лапам редуктора и прицепных подкосов к "
                                         "основным;",
                          "document_id": 'BQACAgIAAxkBAAICkWZ5aF60L66aXftGcGsTR50rkgABnAAClkwAAtpFyEu2dY47GB25QDUE'},




        }
        for task_key, task_data in descriptions_84.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)
    if call.data == 'sis131a':
        descriptions_131 = {
            'sis131a': {"description": "Т.К. 131.11.00б,в: Проверьте внешнее состояние и крепление ММВ к конструкции "
                                       "вертолёта, выполните обслуживание модуля.",
                        "document_id": 'BQACAgIAAxkBAAPRZm8UBXol02mQbUE5XfvwfOIwbNIAAllLAAKmKHhLlt7XdIA-Tj41BA'},
        }
        for task_key, task_data in descriptions_131.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)

    if call.data == 'sis21':
        descriptions_21 = {
           'sis21a': {"description": "Т.К. 21.00.00.а: Проверка внешнего состояния и надежности крепления "
                      "электровентиляторов ДВ-302Т ",
                      "document_id": 'BQACAgIAAxkBAAIBV2ZwGQbHEdIC_LSU9iWAXa3j2oBaAAKpTQACwLqJS5VHQoi39Ub7NQQ'},
           'sis21b': {"description": "021.40.00c: Проверьте работоспособность обогревателя Ко-50(Обогреватель включать "
                                     "только при темперетуре +5 и ниже)",
                      "document_id": 'BQACAgIAAxkBAAIBWWZwGXCO1d_1NRf7_fY5CwP_ioGIAAK1TQACwLqJS5DkMBTFqQAB7zUE'},
            }
        for task_key, task_data in descriptions_21.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                          reply_markup=markup)


    if call.data == 'sis23':
        descriptions_23 = {

           'sis23a': {"description": "Т.К. 023.30.00a: Проверьте функционирование СПУ-7. ",
                      "document_id": 'BQACAgIAAxkBAAIBY2ZwI6kCqfpCh9sTAQtRDJL-1kM9AAIrTgACwLqJSzNVsAurENGYNQQ'},
           'sis23b': {"description": "Т.К. 023.40.00a: Проверьте функционирование переговорного устройства СПУ-7.",
                      "document_id": 'BQACAgIAAxkBAAIBaWZxNPKxBOyg2w7Eg1vCSpfyjlY6AAKdRgACOgKIS_-gorD5x4BzNQQ'},
           'sis23с': {"description": "Т.К. 023.30.00a: Проверьте функционирование СГУ-15. ",
                      "document_id": 'BQACAgIAAxkBAAIBY2ZwI6kCqfpCh9sTAQtRDJL-1kM9AAIrTgACwLqJSzNVsAurENGYNQQ'},
           'sis23d': {"description": "Т.К. 23.51.00.а,b: Внешний осмотр и проверка целости шумозащитных и головного "
                                     "амортизаторов, гигиенических чехлов, оболочек кабеля и вилки соединителя ",
                      "document_id": 'BQACAgIAAxkBAAIBXWZwGxP1UTmJYUBlIBAgkoGdqkSjAALLTQACwLqJSy8EO3zY-mhbNQQ'},
           'sis23e': {"description": "Т.К. 023.20.00f: Проверьте функционирование основной и резервной радиостанции "
                                     "Орлан-85СТ. ",
                      "document_id": 'BQACAgIAAxkBAAIBZWZwJbcB6wrj39KuDJrqHSUmIZnwAAJtTgACwLqJS6oh1vvVQsERNQQ'},
           'sis23q': {"description": "Т.К. 023.10.01b: Проверьте состояние, крепление и натяжение антенн и их элементы.",
                      "document_id": 'BQACAgIAAxkBAAIBa2ZxNwFJGNbDEDpkqpJiFv-aTgeVAAK7RgACOgKIS-mXuS-9uxDoNQQ'},
           'sis23g': {"description": "Т.К. 023.10.01d: Проверьте функционирование р/ст Прима-КВ. ",
                      "document_id": 'BQACAgIAAxkBAAIBZ2ZwJr2WLTBoYDHT6YDezhS0MiCvAAKATgACwLqJS--MPqc-aLZ1NQQ'},
           'sis23i': {"description": "Т.К. 023.11.10с: Проверьте внешнее состояние блоков аварийного радиомаяка "
                                     "АРМ-406П (блока «П»; пульта управления ПДУ-406; антенны АНТ-406В). Осмотрите "
                                     "блоки, убедитесь в наличии бандероли и исправности застежки крепления моноблока "
                                     "АС1А в кожухе блока «П», подсоединения Ш, отсутствии внешних повреждений, "
                                     "пыли и загрязнений. ",
                      "document_id": 'BQACAgIAAxkBAAIBX2ZwHrfiSFU1A5_7QygKA8rUNplIAALfTQACwLqJSxOCXswOPQIyNQQ'},
           'sis23p': {"description": "Т.К. 023.11.10d:Проверьте функционирование моноблока «П» радиомаяка АРМ-406П в "
                                     "режиме встроенного контроля (ВСК) от ПДУ. ",
                      "document_id": 'BQACAgIAAxkBAAIBYWZwHzb9Zc-040exx7qu27XU9z-GAALhTQACwLqJS-20hWh_PocDNQQ'},
           'sis23r': {"description": "Т.К. 023.12.01f: Проверьте состояние и крепление и амортизацию блока,"
                                     " состояние разъемов, кабелей изделия Алмаз-УПМ; убедитесь в чистоте и отсутствии "
                                     "механических повреждений изделий. ",
                      "document_id": 'BQACAgIAAxkBAAID2GZ6ZU53KyV0mFuSK6rvWnPT6guWAAJiUQAC2kXQS3Be7fy7yGxPNQQ'},
           'sis23u': {"description": "Т.К. 023.20.00е: Осмотрите и проверьте состояние и крепление антенн радиостанций "
                                     "Орлан-85СТ. Убедитесь в чистоте и отсутствии механических повреждений. ",
                      "document_id": 'BQACAgIAAxkBAAIBb2ZxQMhrvB7NUggQOBhzeteczQrvAAIoRwACOgKISyGd5XWuZKFRNQQ'},
           'sis23o': {"description": "Т.К. 023.20.00k:Внешний осмотр блоков радиостанций Орлан-85СТ на вертолете ",
                      "document_id": 'BQACAgIAAxkBAAIBcWZxQr8TeJNHWEAr6HPBPJAWX4UBAAJBRwACOgKISy7IBEA0Ije6NQQ'},
           'sis23y': {"description": "023.70.01d: Проверка работоспособности П-507М при подаче напряжения питания "
                                     "(самодиагностика без индикации)",
                      "document_id": 'BQACAgIAAxkBAAIBc2ZxRCIplyAE9WT4rPyIB4zdKfaEAAJSRwACOgKIS8rPimhalzRGNQQ'},
           'sis23t': {"description": "023.70.01f: Проверка работоспособности изделия в режиме проверки "
                                     "записи при помощи ВИКУ",
                      "document_id": 'BQACAgIAAxkBAAIBdWZxRGbmJ58_kp0VU-lGE-DDcZv-AAJURwACOgKISy8690o992B3NQQ'},
            }
        for task_key, task_data in descriptions_23.items():
                markup = types.InlineKeyboardMarkup()
                start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
                markup.add(start_button)
                document_id = task_data['document_id']
                bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                                  reply_markup=markup)


    if call.data == 'sis24':
        descriptions_24 = {
           'sis24k': {"description": "Т.К. 24.30.03f: Проверка работы системы постоянного тока",
                      "document_id": 'BQACAgIAAxkBAAIBd2ZxUo0C1iwkXBw_yF84F6NIfEVpAAIFSAACOgKIS1hHjODm7OBHNQQ'},
           'sis24m': {"description": "Т.К. 24.30.00g: Проверка внешнего состояния и надежности крепления "
                                     "выпрямительных устройств ВУ-6Б",
                      "document_id": 'BQACAgIAAxkBAAIBeWZxU0UAASVsCw4Tb0flmZRorjSe6QACDkgAAjoCiEsF5mcJ6ae_nDUE'},
           'sis24r': {"description": "Т.К. 24.30.00h: Очистка лопаток вентилятора выпрямительного устройства "
                                     "от накопившейся пыли",
                      "document_id": 'BQACAgIAAxkBAAIBe2ZxU-_5Aq8nvTwCN1hnYbUqtCzQAAIdSAACOgKIS-EYqhNU96uNNQQ'},
           'sis24q': {"description": "Т.К. 24.30.00i: Проверка работоспособности обогрева аккумуляторов"
                                     "(Работу выполнять при отрицательной температуре)",
                      "document_id": 'BQACAgIAAxkBAAIBfWZxVCxt5_MLE-FI4djYSB60fajaAAImSAACOgKIS7uJjPhFbUuWNQQ'},
           'sis24t': {"description": "Т.К. 24.50.00b: Осмотр распределительных устройств и аппаратуры, смонтированной"
                                     " в них",
                      "document_id": 'BQACAgIAAxkBAAIBf2ZxVLMiV113rPX8GP0rVTkG8_yuAAIzSAACOgKIS738Vl0DyoFDNQQ'},

           'sis24y': {"description": "Т.К. 24.50.00c: Осмотр минусовых проводов",
                      "document_id": 'BQACAgIAAxkBAAIBgWZxVPiaoYKZTd-NOTraW7WQ-1YkAAI5SAACOgKISzVOTJwfo7LINQQ'},
           'sis24u': {"description": "Т.К. 24.60.00a: Осмотр металлизации конструкции и оборудования вертолета",
                      "document_id": 'BQACAgIAAxkBAAIBg2ZxVS43E25E6R3q3jREnatOSfQuAAI6SAACOgKIS6U6MebZHbh3NQQ'},
           'sis24o': {"description": "Т.К. 24.20.00p: Проверка внешнего состояния и надежности крепления блока "
                                     "трансформаторов P/N 20736-100",
                      "document_id": 'BQACAgIAAxkBAAIBhWZxWos6oDrXzvgVcwXYBrxh1bymAAJtSAACOgKIS6Paeq-vinECNQQ'},
           'sis24s': {"description": "Т.К. 24.20.00s: Проверка работы генератора ВСУ Safir(2 пункт не выполнять)",
                      "document_id": 'BQACAgIAAxkBAAIBh2ZxWrZw1cUT_Q3Lc59chJ52D0SUAAJySAACOgKIS336DP6T9ayDNQQ'},
           'sis24w': {"description": "Т.К. 24.20.00c1: Проверьте внешнее состояние и надежность крепления "
                                     "трансформаторов ТС310С04Б и преобразователя СПО-9",
                      "document_id": 'BQACAgIAAxkBAAICRmZ20cp0ObnaiaCqlxrL6389c_8LAAJuUwAC8SO4S2skYa0Pc6ZuNQQ'},
           'sis24i': {"description": "Т.К. 024.20.00e1: Проверьте внешнее состояние, надежность крепления блоков "
                                     "БРН120Т5А, БЗУНП355Г и рамы РМ355Г)",
                      "document_id": 'BQACAgIAAxkBAAICSmZ20-FzWl4LbMtmXaA2wv6pw_dvAAKAUwAC8SO4SyvMkfFT0a0CNQQ'},
           'sis24p': {"description": "Т.К. 024.20.00f1:Проверьте внешнее состояние, надежность крепления "
                                     "трансформаторов Тр115/36 и автоматов АПШ-3М)",
                      "document_id": 'BQACAgIAAxkBAAICTGZ21ZUfRFo1ErSfiTnmw0mePuxcAAKUUwAC8SO4SxQ_U59aGr-DNQQ'},
           'sis24z': {"description": "Т.К. 024.20.00b1: Проверьте работу преобразователей ПТС-800БМ, СПО-9 и "
                                     "трансформаторов ТСЗ10С04Б, Тр115/36)",
                      "document_id": 'BQACAgIAAxkBAAICTmZ21pITaDSfkcSitP0fQ3hKWLe8AAKkUwAC8SO4SxEVgqn6UB4wNQQ'},
           'sis24x': {"description": "Т.К. 024.20.00а1: При опробовании двигателей проверьте работу системы переменного"
                                     " тока",
                      "document_id": 'BQACAgIAAxkBAAICUGZ21zj1FORIcEzuKU6THSOyGdPdAAKpUwAC8SO4S2QNL_fuONWENQQ'},
           'sis24c': {"description": "Т.К. 024.20.00g1,h1: Проверьте внешнее состояние блока трансформаторов"
                                     " P/N 20736-100 и коробки управления P/N 2438-100, убедитесь в надежности их "
                                     "крепления,",
                      "document_id": 'BQACAgIAAxkBAAICUmZ22aCTyVXUay65hKmPeQ1zZgABKgACzVMAAvEjuEv1Ynsi0mT-iDUE'},
           'sis24f': {"description": "Т.К. 024.20.00j1: Проверьте работоспособность генераторов ВСУ.",
                      "document_id": 'BQACAgIAAxkBAAICVGZ22mq8tuFJjp6aqPdqLKlq8nBoAALZUwAC8SO4S6uj0oxxIjVnNQQ'},
           'sis24a': {"description": "Т.К. 024.30.00а1: Проверьте работу системы постоянного тока.",
                      "document_id": 'BQACAgIAAxkBAAICVmZ221A2hnjZViDItNkxY2UAAV6LpgAC31MAAvEjuEsBJ2jJ4b_awjUE'},
           'sis24g': {"description": "Т.К. 024.30.00b1: Проверьте работоспособность дифференциальных реле ДМР-200ВУ",
                      "document_id": 'BQACAgIAAxkBAAICWGZ22_XW6Vr59yrR4Kd_N0B32dUIAALlUwAC8SO4S0jAMa_livFINQQ'},
           'sis24h': {"description": "Т.К. 024.30.00b1,с1: Проверьте внешнее состояние и надежность крепления и "
                                     "очистите выпрямительные устройства ВУ-6Б",
                      "document_id": 'BQACAgIAAxkBAAICWmZ23WKLwMR27j7x9QrmS4fxIO7BAALuUwAC8SO4S0llW4TOeY16NQQ'},
           'sis24j': {"description": "Т.К. 024.40.00b1,с1: Проверьте работоспособность сети внешнего питания",
                      "document_id": 'BQACAgIAAxkBAAICXGZ23khfTri7aReg-BK9spqK38gYAAL2UwAC8SO4SxLXc2tQUTFbNQQ'},
           'sis24d': {"description": "Т.К. 024.50.00b1: Осмотрите и проверьте распределительные устройства и "
                                     "аппаратуру, смонтированную в них",
                      "document_id": 'BQACAgIAAxkBAAICXmZ232lD0tnG6h_Nt1sY_e14vviLAAISVAAC8SO4S_Rt3OKNxtveNQQ'},
           'sis24l': {"description": "Т.К. 024.50.00с1: Осмотрите минусовые провода",
                      "document_id": 'BQACAgIAAxkBAAICYGZ239eDUBwb73esJ5dCSyHySifeAAIcVAAC8SO4S18YR_3Z439ONQQ'},

            }
        for task_key, task_data in descriptions_24.items():
                markup = types.InlineKeyboardMarkup()
                start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
                markup.add(start_button)
                document_id = task_data['document_id']
                bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                                  reply_markup=markup)

    if call.data == 'sis26a':
        descriptions_26 = {
           'sis26k': {"description": "Т.К. 026.10.00а,b,c: Осмотрите датчики сигнализации пожара, их электропроводку, "
                                     "розетки, исполнительные блоки и их амортизаторы. Убедитесь в отсутствии"
                                     "повреждений агрегатов, надежности их крепления, подсоединения ШР, "
                                     "исправности контровки.",
                      "document_id": 'BQACAgIAAxkBAAIBiWZxX0vlcM8T5nniYfHHz9nASLyuAAKuSAACOgKIS6s6Io8zk-ZNNQQ'},
           'sis26b': {"description": "Т.К. 026.10.00d: Проверьте работоспособность системы сигнализации о пожаре.",
                      "document_id": 'BQACAgIAAxkBAAIBi2ZxYBCR_9ok7sM4fTGCps1JqhylAAK3SAACOgKISxwKMOYlvRx8NQQ'},
           'sis26c': {"description": "Т.К. 026.20.00c,g: Проверьте работоспособность системы пожаротушения и"
                                     " целостность электрических цепей ручного включения средств пожаротушения.",
                      "document_id": 'BQACAgIAAxkBAAIBjWZxYRv4GsD6B45KV9o0HHrlalvUAALBSAACOgKIS6mBYUdrEytrNQQ'}
            }
        for task_key, task_data in descriptions_26.items():
                markup = types.InlineKeyboardMarkup()
                start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
                markup.add(start_button)
                document_id = task_data['document_id']
                bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                                  reply_markup=markup)

    if call.data == 'sis28':
        descriptions_28 = {
            'sis28a': {"description": "Т.К. 028.20.00c,d: Проверка работоспособности топливных насосов",
                       "document_id": 'BQACAgIAAxkBAAIBj2ZxZJAyLwwULKLjvhc7IEH2hJ9xAALuSAACOgKIS3jMsWvfvapnNQQ'},
            'sis28b': {"description": "Т.К. 028.40.00c: Проверка исправности ламп табло БАК ПОЛОН",
                       "document_id": 'BQACAgIAAxkBAAIBkWZxZLyj1wZ2hBiXsjfHAo3i27UZAALxSAACOgKIS-ZeCloDZ4ukNQQ'},
            'sis28c': {"description": "Т.К. 028.20.00a: Проверьте надежность затяжки и контровки накидных гаек "
                                      "штепсельных разъемов насоса 463Б, электромагнитного крана 610200, пожарного "
                                      "крана 768600МА, убедитесь в исправности защитных чехлов. Проверьте внешнее "
                                      "состояние и надежность крепления конденсаторов К50.",
                       "document_id": 'BQACAgIAAxkBAAIBk2ZxZTp2oL9TCN5ZqcxP53S7kx0cAAL6SAACOgKIS0GT3KPgra0yNQQ'},
            'sis28d': {"description": "Т.К. 028.40.00d: Проверьте работоспособность топливомера..",
                       "document_id": 'BQACAgIAAxkBAAIBx2Zy06hlC3vcQOM-DpPtzmvX81-YAALBTQACsB2YS1fqc4a6izioNQQ'},
            'sis28f': {"description": "Т.К. 028.40.00e: Осмотрите и проверьте состояние и крепление сигнализаторов"
                                      " давления СД-29А.",
                       "document_id": 'BQACAgIAAxkBAAIByWZy1CAbZWXaVTKtpPW6go2qI6GFAALKTQACsB2YS67WizBYQezHNQQ'},
            'sis28r': {"description": "Т.К. 028.40.00f: Проверьте внешнее состояние и крепление датчиков топливомера "
                                      "СКЭС-2027Б.",
                       "document_id": 'BQACAgIAAxkBAAIBy2Zy1GZyBeQHr4QlBA97Ab-9FIemAALQTQACsB2YS3DVbDRXX2JNNQQ'},
        }
        for task_key, task_data in descriptions_28.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)

    if call.data == 'sis29':
        descriptions_29 = {
            'sis29a': {"description": "Т.К. 029.30.00a: Осмотр датчиков ИД-100, манометров ДИМ-100 и сигнализаторов"
                                      " давления МСТ-30А и МСТ-25А",
                       "document_id": 'BQACAgIAAxkBAAIBlWZxZrEXNvrFBxKHBlChQoLXS8_kAAIMSQACOgKISyJyvle0QdWUNQQ'},

        }
        for task_key, task_data in descriptions_29.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)
    if call.data == 'sis30':
        descriptions_30 = {
            'sis30a': {"description": "Т.К. 030.20.00a: Осмотр терморегуляторов ТЭР-1М",
                       "document_id": 'BQACAgIAAxkBAAIBl2ZxZ5JqPBlO7GBjlO9ZWZ8fKhFIAAIYSQACOgKIS10kqc5WqUBMNQQ'},
            'sis30b': {"description": "Т.К. 030.40.00a: Осмотр электроагрегатов противообледенительной системы стекол",
                       "document_id": 'BQACAgIAAxkBAAIBmWZxZ8fIKsW5djBOSrM7LxhB8i9AAAIdSQACOgKISw-LzDwEtyqYNQQ'},
            'sis30c': {"description": "Т.К. 030.40.00d: Проверка надежности подсоединения проводов к термодатчикам "
                                      "стекол",
                       "document_id": 'BQACAgIAAxkBAAIBm2ZxZ_5-Q4ZsXxEEt66Rzat7LxXUAAIhSQACOgKIS4uc2zLUJJNpNQQ'},
            'sis30d': {"description": "Т.К. 030.60.00a: Осмотр агрегатов и жгутов противообледенительной системы винтов",
                       "document_id": 'BQACAgIAAxkBAAIBnWZxaCjnkrzYFm25IljBU7FW1jMeAAIjSQACOgKISyma4RjSHg1_NQQ'},
            'sis30h': {"description": "Т.К. 030.60.00f: Продуйте узел контактных колец токосъемника рулевого винта "
                                      "сжатым воздухом.",
                       "document_id": 'BQACAgIAAxkBAAIBn2ZxaQABOPYOnMmvIBF-DozkShqgPAACJ0kAAjoCiEuAJwu2QJLo9DUE'},
            'sis30e': {"description": "Т.К. 030.80.00a: Осмотр датчика сигнализатораобледенения из комплекта СО-121ВМ",
                       "document_id": 'BQACAgIAAxkBAAIBoWZxaUQhWgQKaKPQ8WuuTv7tDPtIAAItSQACOgKISzSaHw4QTLqFNQQ'},
            'sis30f': {"description": "Т.К. 030.80.00b: Осмотр преобразователя сигнализатора обледенения из комплекта "
                                      "СО-121ВМ",
                       "document_id": 'BQACAgIAAxkBAAIBo2ZxaXE3pND64i5Lul-r4v0xRbQWAAIySQACOgKIS_XhrdaW37mdNQQ'},
            'sis30g': {"description": "Т.К. 030.80.00c: Проверка работоспособности сигнализатора обледенения СО-121ВМ",
                       "document_id": 'BQACAgIAAxkBAAIBpWZxaZ3YsJOgt_DjGWit1ZirF37nAAI0SQACOgKIS8PEC3RklUMCNQQ'},
            'sis30q': {"description": "Т.К. 030.80.00d: Проверьте сигнализатор обледенения СО-121ВМ.",
                       "document_id": 'BQACAgIAAxkBAAIBqWZxasnDjdb_VGktEQfJWiqUSitGAAJGSQACOgKISz-6yyCdUsRwNQQ'},
        }
        for task_key, task_data in descriptions_30.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)
    if call.data == 'sis31':
        descriptions_31 = {
            'sis31a': {"description": "Т.К. 031.20.00: Проверьте функционирование авиационных часов.",
                       "document_id": 'BQACAgIAAxkBAAIBsWZxeWMYJ_HnLiWQCJLeSt-kDck_AAIPSgACOgKIS6y8yRHIcvEvNQQ'},
            'sis31b': {"description": "Т.К. 031.10.00b: Вскройте панели приборных досок. Осмотрите электропроводку, "
                                      "штепсельные разъемы.",
                       "document_id": 'BQACAgIAAxkBAAIBw2ZyzEsU6EtoN0GjV5PpazQreD-nAAJdTQACsB2YSzZJAREGtMEqNQQ'},
            'sis31c': {"description": "Т.К. 031.10.00а: Осмотрите высотомеры, убедитесь в отсутствии повреждений и "
                                      "наличии краски (колпачков) фиксирующей кремальеры. По их шкалам убедитесь в "
                                      "соответствии барометрического давления атмосферному, приведенному к месту "
                                      "стоянки.",
                       "document_id": 'BQACAgIAAxkBAAIBxWZyzPIvHmsukhKwU10XVl058aOaAAJkTQACsB2YS1I87CLxjCmFNQQ'}
        }
        for task_key, task_data in descriptions_31.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)

    if call.data == 'sis33':
        descriptions_33 = {
            'sis33a': {"description": "Т.К. 033.10.00a1: Осмотр осветительного оборудования кабины экипажа",
                       "document_id": 'BQACAgIAAxkBAAICZGZ5Eea4XiEsxeqS6zSVKCV58dDWAAJGSQAC2kXIS1F5p2zDswZHNQQ'},
            'sis33b': {"description": "Т.К. 033.30.00a1,b1,c1: Осмотр стекол плафонов осветительного оборудования "
                                      "грузовых и технических отсеков",
                       "document_id": 'BQACAgIAAxkBAAICaGZ5E9rFbFGpGYt462RGEI5tZB1GAAJPSQAC2kXIS_26d_me8O41NQQ'},
            'sis33c': {"description": "Т.К. 033.40.00a,b,c-1: Осмотр светофильтров и стекол внешнего "
                                      "осветительного и светосигнального оборудования",
                       "document_id": 'BQACAgIAAxkBAAICamZ5FON1hdWMpbHXecDjIQxwmLl7AAJYSQAC2kXIS_6RrpR4Ur_cNQQ'},
            'sis33d': {"description": "Т.К. 033.10.00с1: Проверьте работоспособность системы САС-4-9. "
                                      "Проведите внешний осмотр блоков, надежность крепление блоков, БАП-1,БУ-1, БК-7",
                       "document_id": 'BQACAgIAAxkBAAICZmZ5EqINe5MMk_niGXXxPAPqO4CWAAJJSQAC2kXIS2axaAyFgVMPNQQ'},
            'sis33e': {"description": "Т.К. 033.10.00с1: Проверьте работоспособность системы САС-4-9. "
                                      "Проведите внешний осмотр блоков",
                       "document_id": 'BQACAgIAAxkBAAICZmZ5EqINe5MMk_niGXXxPAPqO4CWAAJJSQAC2kXIS2axaAyFgVMPNQQ'},


        }
        for task_key, task_data in descriptions_33.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)

    if call.data == 'sis34':
        descriptions_34 = {
            'sis34a': {"description": "Т.К. 034.10.00b: Проверка герметичности системы ПВД",
                       "document_id": 'BQACAgIAAxkBAAIBs2Zxhqq1nIRjn9tZX2OgOmApzcs7AAKfSgACOgKIS1VNNQbRUQf8NQQ'},
            'sis34b': {"description": "Т.К. 034.10.00d: Проверьте функционирование обогрева приемников ПВД "
                                      "(по загоранию табло).",
                       "document_id": 'BQACAgIAAxkBAAIBs2Zxhqq1nIRjn9tZX2OgOmApzcs7AAKfSgACOgKIS1VNNQbRUQf8NQQ'},
            'sis34c': {"description": "Т.К. 034.10.00d: Проверьте функционирование обогрева приемников ПВД "
                                      "(по загоранию табло).",
                       "document_id": 'BQACAgIAAxkBAAIBs2Zxhqq1nIRjn9tZX2OgOmApzcs7AAKfSgACOgKIS1VNNQbRUQf8NQQ'},
            'sis34d': {"description": "Т.К. 034.20.00n: Проверьте функционирование выключателя коррекции ВК-53РВ.",
                       "document_id": 'BQACAgIAAxkBAAIBtWZyZq_yorlgtnu_bgiLG-NBtJNJAALOQwACOgKQS1aBzB2wzvgyNQQ'},
            'sis34e': {"description": "Т.К. 034.20.00f: Проверьте функционирование авиагоризонтов АГБ-ЗК (раздельно от "
                                      "основного источника и резервного преобразователя)",
                       "document_id": 'BQACAgIAAxkBAAIBt2ZyaHOeCK8XUNiC0nz0bO01tQP1AALaQwACOgKQS9A7GS36QxU2NQQ'},
            'sis34o': {"description": "Т.К. 034.20.00r: Проверьте функционирование курсовой системы ГМК-1А.)",
                       "document_id": 'BQACAgIAAxkBAAIBuWZyxlH14hfAySyfVHMhvJN3Ku5_AAIMTQACsB2YS6U6eN1qsxoTNQQ'},
            'sis34g': {"description": "Т.К. 034.20.00h: Проверьте функционирование блока сравнения и сигнализации "
                                      "предельных кренов БСПК-1..)",
                       "document_id": 'BQACAgIAAxkBAAIBu2ZyxtT-JH_ui6nRCgk840rsBEE6AAIYTQACsB2YS2jIYyAhPtPrNQQ'},
            'sis34h': {"description": "Т.К. 034.10.00a: Осмотрите агрегаты системы ПВД. Убедитесь в отсутствии "
                                      "повреждений, надежности подсоединения трубопроводов, исправности контровки. "
                                      "Слейте конденсат из влагоотстойников. Прочистите отверстия приемника "
                                      "статического давления корректора высоты КВ-11 автопилота.)",
                       "document_id": 'BQACAgIAAxkBAAIBvWZyx5Fr3kV4PMKTCXhsrOkb4_tjAAIiTQACsB2YS7XPgEUeJmt4NQQ'},
            'sis34j': {"description": "Т.К. 034.20.00b: Осмотрите компас КИ-13. Убедитесь в надежности его крепления, "
                                      "в наличии контровки винтов девиационного устройства, в наличии графика "
                                      "девиационных поправок на вертолете.)",
                       "document_id": 'BQACAgIAAxkBAAIBv2ZyyPVkOvJU1MIfO2vOcUAYtT0ZAAIxTQACsB2YS6q2_nYXdLJ-NQQ'},
            'sis34k': {"description": "Т.К. 034.20.00с: Убедитесь в наличии таблиц показаний высотомеров, указателей"
                                      " скорости и графиков девиации КИ-13К и ГМК-1, в соответствии номеров приборов"
                                      " номерам, указанным в таблицах.)",
                       "document_id": 'BQACAgIAAxkBAAIBwWZyyfKSWpzZcbxlSlkui1wl6xzjAAJCTQACsB2YS-XzO5MeiR4WNQQ'}
        }
        for task_key, task_data in descriptions_34.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)

    if call.data == 'sis49':
        descriptions_49 = {
            'sis49a': {"description": "Т.К. 049.40.00a: Убедитесь в надежности крепления электроагрегатов , жгутов,"
                                      "штепсельных разьемов  ВСУ Safir",

                       "document_id": 'BQACAgIAAxkBAAIBz2Zy2Kv8U8SdZCNKWPqTQa6X1JS1AAIETgACsB2YS_4CEd2lhULRNQQ'},
            'sis49b': {"description": "Т.К. 049.40.00d: Произвести тест-контролькоробки управления P/N2438-100 "
                                      "ВСУ Safir",
                       "document_id": 'BQACAgIAAxkBAAIB0WZy2NO4V9XYr9LJITRxwIurSJVVAAIHTgACsB2YS-l25TwZBtedNQQ'},
            'sis49c': {"description": "Т.К. 049.70.00b: У указателя температуры LUN 1386.01 проверьте: - надежность "
                                      "подсоединения проводов термопар к датчику; - внешнее состояние и крепление; "
                                      " сопротивление изоляции цепи термопар датчика температуры LUN 1385.81",
                       "document_id": 'BQACAgIAAxkBAAICbGZ5JeIthLISeEJua29cIoMmcM2-AALTSQAC2kXISxVbBfJh7QvDNQQ'},
            'sis49d': {"description": "Т.К. 049.40.00e: Проверка внешнего состояния и надежности крепления коробки "
                                      "управления LUN 5271.80/CONB-",
                       "document_id": 'BQACAgIAAxkBAAICbmZ5TPp7i8rPAibt9F5U5V3OeGLmAAJpSwAC2kXISz1XgcChnVJCNQQ'},

        }
        for task_key, task_data in descriptions_49.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)
    if call.data == 'sis65a':
        descriptions_65a = {
            'sis65d1': {"description": "Т.К. 065.40.00i: Проверка регулировки микровыключателя механизма подвижного"
                                       " упора системы СПУУ-52",
                        "document_id": 'BQACAgIAAxkBAAIBzWZy16O8ld1Y14ioViUPu1kaYPtlAAL1TQACsB2YS404VVjhGxRTNQQ'}
        }
        for task_key, task_data in descriptions_65a.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)


    if call.data == 'sis72a':
        descriptions_72 = {
            'sis72c': {"description": "Т.К. 072.00.00 ТК 607: Проверьте отсутствие замыкания между каналами термопар и "
                                      "массой двигателя.",
                       "document_id": 'BQACAgIAAxkBAAIB1GZy2tXUzoVO-03yab94UDL42Q7QAAI0TgACsB2YS83V7kvIKuBfNQQ'},

        }
        for task_key, task_data in descriptions_72.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)

    if call.data == 'sis73a':
        descriptions_73 = {
            'sis73a': {"description": "Т.К. 073.10.00a: Проверка внешнего состояния и надежности крепления регулятора"
                                      " температуры РТ-12-6",
                       "document_id": 'BQACAgIAAxkBAAIB1mZy23_FFWb6RGplPmVnLfs2IXxEAAJBTgACsB2YS-gBhdK9cT8tNQQ'},
            'sis73b': {"description": "Т.К. 073.10.00b: Проверьте общее сопротивление цепи термопар у клемм регулятора"
                                      " температуры РТ12-6.",
                       "document_id": 'BQACAgIAAxkBAAIB2GZy3nc0wT0PsMCdFEv86FIR0SHjAAJwTgACsB2YSw6p0lcyAQhhNQQ'},

        }
        for task_key, task_data in descriptions_73.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)

    if call.data == 'sis77':
        descriptions_77 = {
            'sis77a': {"description": "Т.К. 077.20.00a: Осмотр усилителя 2УЭ-6Б из комплекта 2ИА-6",
                       "document_id": 'BQACAgIAAxkBAAIB2mZy7DRKhFETPHfxRMgHyZ5RG-UhAAIOTwACsB2YS1Hn6Q28O3cHNQQ'},
            'sis77b': {"description": "Т.К. 077.20.00b: Проверка измерительной аппаратуры 2ИА-6 с помощью "
                                      "встроенного контроля",
                       "document_id": 'BQACAgIAAxkBAAIB3GZy7F1F9aPNJSzWmt7EROIhWlDNAAITTwACsB2YS4YIr6_K_bBANQQ'},
            'sis77c': {"description": "Т.К. 077.30.00q: Проверка внешнего состояния изделий аппаратуры ИВ-500E",
                       "document_id": 'BQACAgIAAxkBAAIB3mZy7I6EnBdfxaZ0xDpl_oHKMzKcAAIYTwACsB2YS2f2CGZULA6ONQQ'},
            'sis77d': {"description": "Т.К. 077.30.00m: Проверка аппаратуры встроенным контролем ИВ-500E",
                       "document_id": 'BQACAgIAAxkBAAIB4GZy7OVEKrVCmdbhN7pm7LMpOTcjAAIfTwACsB2YS8NUavGQiesHNQQ'}

        }
        for task_key, task_data in descriptions_77.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)

    if call.data == 'sis110':
        descriptions_110 = {
            'sis110a': {"description": "Т.К. 110.40.00а:Проверьте функционирование радиовысотомера А-037 (РВ-3).",
                        "document_id": 'BQACAgIAAxkBAAIB4mZ0EFG33OJ0PkvUwqYQxPxIrCPPAAKxSwACsB2gS2vncRZVZ6HINQQ'},
            'sis110b': {"description": "Т.К. 110.10.00d: Проверьте крепление и состояние обтекателя антенны АН "
                                       "радиокомпаса АРК-15М",
                        "document_id": 'BQACAgIAAxkBAAIB5GZ0EUPcTbSoXqoev_Lq7uPYlb30AALESwACsB2gS0Fwa_PVDONANQQ'},
            'sis110c': {"description": "Т.К. 110.10.00e: Осмотрите внешнее состояние, проверьте крепление и амортизацию"
                                       "блоков, затяжку и контровку накидных гаек разъемов, состояние и крепление "
                                       "кабелей радиокомпаса АРК-15М.",
                        "document_id": 'BQACAgIAAxkBAAIB5mZ0EyO2r8NU0jWaLxsdMCL80_afAALjSwACsB2gS8mVtzWoSr49NQQ'},
            'sis110d': {"description": "Т.К. 110.21.00d: Проверьте внешнее состояние пульта изделия TSS.",
                        "document_id": 'BQACAgIAAxkBAAIB6GZ0IeaH5K97meEgLZA7R8wqldoBAAKtTAACsB2gS3_LF6MSdZV-NQQ'},
            'sis110e': {"description": "Т.К. 110.60.01с: Проверьте внешнее состояние панели (пульта) управления "
                                       "системы TTA-12H.",
                        "document_id": 'BQACAgIAAxkBAAIB6mZ0Iouag6TOd5HW4HoEEBhcAiz4AAK5TAACsB2gS7JSnzbau4TyNQQ'},
            'sis110f': {"description": "Т.К. 110.61.00c: Проверьте внешнее состояние многофункционального "
                                       "индикатора TDS-56D.",
                        "document_id": 'BQACAgIAAxkBAAIB7GZ0IzbZgTvcJ_iCwHhbv6nJwhmkAALDTAACsB2gSyp4nDHSURMKNQQ'},
            'sis110g': {"description": "Т.К. 110.73.00f: Осмотрите радиопрозрачный обтекатель антенны метеолокатора "
                                       "1А813М.",
                        "document_id": 'BQACAgIAAxkBAAIB7mZ0I75VidXcO8W2rwoDtMDKnm_LAALGTAACsB2gS5zW7jbzd426NQQ'},
            'sis110h': {"description": "Т.К. 110.73.00с: Проверьте внешнее состояние метеолокатора 1А813М.",
                        "document_id": 'BQACAgIAAxkBAAIB8GZ0JDzKxVC2zve2-xHrXQ-c3pcKAALLTAACsB2gS0xLsliqaPO6NQQ'},
            'sis110j': {"description": "Т.К. 110.73.00d: Проверьте состояние и отбортовки кабельного разветвителя, "
                                       "состояние перемычек металлизации кабелей и блоков метеолокатора 1А813М.",
                        "document_id": 'BQACAgIAAxkBAAIB8mZ0JKf4gKCOFVt4CKZGYck0BcbkAALQTAACsB2gS378d2sITQ61NQQ'},
            'sis110k': {"description": "Т.К. 110.10.00a: Проверьте функционирование радиокомпаса АРК-15М.",
                        "document_id": 'BQACAgIAAxkBAAIB9GZ0J1MyA5UegJiWvMpXuOIf45ziAAILTgACsB2oSxgzEdyVMWw3NQQ'},
            'sis110l': {"description": "Т.К. 110.21.00с: Проверьте функционирование аппаратуры TSS.",
                        "document_id": 'BQACAgIAAxkBAAIB9mZ0J8nWKnJAk-ip-KN-TlRXJWCPAAIPTgACsB2oSy_Qj1wnq7NvNQQ'},
            'sis110q': {"description": "Т.К. 110.60.01d: Проверьте функционирование системы ТТА-12Н со встроенным "
                                       "контролем.",
                        "document_id": 'BQACAgIAAxkBAAIB-GZ0KYfmTWEXqW5bYIDQAsKbJHePAAIkTgACsB2oS0ldCQsOQYznNQQ'},
            'sis110w': {"description": "Т.К. 110.61.00d: Проверьте функционирование индикатора TDS-56D.",
                        "document_id": 'BQACAgIAAxkBAAIB-mZ0KfInwhhntozfQMmODcg2Z-hVAAIpTgACsB2oS76sYQ71c2L_NQQ'},
            'sis110r': {"description": "Т.К. 110.73.00е: Проверьте работоспособность метеолокатора 1А813М.",
                        "document_id": 'BQACAgIAAxkBAAIB_GZ0KleErx5O6IUG814dMITjjhu0AAIuTgACsB2oSzRv-gPQeLjvNQQ'},
        }
        for task_key, task_data in descriptions_110.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)

    if call.data == 'sis113':
        descriptions_113 = {
            'sis113a': {"description": "Т.К. 113.30.00а: Проверьте внешнее состояние и крепление ответчика СО-2010.",
                        "document_id": 'BQACAgIAAxkBAAIB_mZ0LlAYeqsWJX46WCwqdSvSZKHUAAJWTgACsB2oS3jRm8RJJGAxNQQ'},
            'sis113b': {"description": "Т.К. 113.30.00b: Проверьте работоспособность ответчика СО-2010 ВСК",
                        "document_id": 'BQACAgIAAxkBAAICAAFmdC6u088oeMwT4n-r84XJnkaBGwACWk4AArAdqEuSRCFsbuhcvjUE'},
        }
        for task_key, task_data in descriptions_113.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)
    if call.data == 'sis117':
        descriptions_117 = {
            'sis117a': {"description": "Т.К. 117.10.00a: Выполните проверку внешнего вида УБС-К.",
                        "document_id": 'BQACAgIAAxkBAAIB_mZ0LlAYeqsWJX46WCwqdSvSZKHUAAJWTgACsB2oS3jRm8RJJGAxNQQ'},
            'sis117b': {"description": "Т.К. 117.10.00b: Проверьте работоспособность УБС-К.",
                        "document_id": 'BQACAgIAAxkBAAICBGZ0Qi3s_QghXMGogatWi_1hO-67AAJhTwACsB2oS1Ms2P8CAAH8xjUE'},
        }
        for task_key, task_data in descriptions_117.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)

    if call.data == 'sis129':
        descriptions_129 = {
            'sis129a': {"description": "Т.К. 129.20.00b: Осмотрите электрожгуты, пульты управления в кабине экипажа, "
                                       "кожухи и кассеты ЭКСР-46.",
                        "document_id": 'BQACAgIAAxkBAAICBmZ0RDGEKLDrEx9hs4lQVA_WsYlWAAJuTwACsB2oS-1byB0-OOwDNQQ'},
            'sis129b': {"description": "Т.К. 129.20.00a: Проверьте кассеты ЭКСР-46 под током при помощи приспособления.",
                        "document_id": 'BQACAgIAAxkBAAICCGZ0RJmRo201pa6xMLy3IeP1p4T5AAJ3TwACsB2oSw8Y_6iGDEkqNQQ'},
        }
        for task_key, task_data in descriptions_129.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)
    if call.data == 'sis131':
        descriptions_131 = {
            'sis131a': {"description": "Т.К. 131.11.00 в: Осмотрите распределительную кробку вертолётного медицинского"
                                       " модуля ММВ.9520.000-03 (04)..",
                        "document_id": 'BQACAgIAAxkBAAICCmZ0RiDQnFHEg3nRHWKx7U7PMaL7AAKNTwACsB2oS1b-kArmY748NQQ'},
            'sis131b': {"description": "Т.К. 131.11.00 б п.2: Проверьте внешнее состояние электрических соединителей и "
                                       "жгутов подключения модулей ММВ.",
                        "document_id": 'BQACAgIAAxkBAAICDGZ0Rmy2FtXUgGd0hiFbsOaSd2FfAAKRTwACsB2oSz6eFoF0XO6sNQQ'},
            'sis131c': {"description": "Т.К. 131.11.00 б п.3: Проверьте внешнее состояние предохранителей и минусовых"
                                       " проводов в цепи питания ММВ.",
                        "document_id": 'BQACAgIAAxkBAAICDGZ0Rmy2FtXUgGd0hiFbsOaSd2FfAAKRTwACsB2oSz6eFoF0XO6sNQQ'},
            'sis131d': {"description": "Т.К. 131.11.00 д: Проверьте систему электроснабжения ММВ от генератора"
                                       " вспомогательной силовой установки и от основных генераторов ГТ40-ПЧ8В..",
                        "document_id": 'BQACAgIAAxkBAAICDmZ0R1oMF2xabJxCT0K43a_f9STOAAKbTwACsB2oS06pfigcFa6sNQQ'},
        }
        for task_key, task_data in descriptions_131.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)

    if call.data == 'sis142':
        descriptions_142 = {
            'sis142a': {"description": "Т.К. 142.10.00а : Проверьте внешнее состояние и надежность крепления датчиков "
                                       "системы регистрации параметров.",
                        "document_id": 'BQACAgIAAxkBAAICEGZ0STk7x7G5PBPXWwJ8bZL7CtEAA7JPAAKwHahLmMWF51wHGys1BA'},
            'sis142b': {"description": "Т.К. 142.10.00d : Проверьте состояние аппаратуры, расположенной в РК БУР.",
                        "document_id": 'BQACAgIAAxkBAAICEmZ0Sa6ow8gSZcet58C7HI096OwRAAK3TwACsB2oSy1qap1DfjrfNQQ'},
            'sis142c': {"description": "Т.К. 142.11.00е : Осмотрите внешнее состояние и крепление блоков "
                                       "БУР-1-2 (БУР-1-2 сер. 2)..",
                        "document_id": 'BQACAgIAAxkBAAICDGZ0Rmy2FtXUgGd0hiFbsOaSd2FfAAKRTwACsB2oSz6eFoF0XO6sNQQ'},

        }
        for task_key, task_data in descriptions_142.items():
            markup = types.InlineKeyboardMarkup()
            start_button = types.InlineKeyboardButton("Начать", callback_data=f'start_{task_key}')
            markup.add(start_button)
            document_id = task_data['document_id']
            bot.send_document(call.message.chat.id, document_id, caption=task_data['description'],
                              reply_markup=markup)


@bot.callback_query_handler(func=lambda call: call.data.startswith('start_'))
def handle_start_button_click(call):
    global task_finish_buttons  # Declare task_finish_buttons as global

    user_id = call.from_user.id
    task_type = call.data.split('_')[1]
    data = db.select_task(task_type)
    user_info = call.from_user
    chat_id = call.message.chat.id
    descriptions = get_task_description(task_type)
    task_start_times[chat_id] = time.time()
    task_finish_buttons[chat_id] = f'finish_{task_type}'

    markup = types.InlineKeyboardMarkup()
    if data is not None:
        if data['state'] == 'available':
            # переводим кнопку в состояние занятой
            cur.execute("UPDATE tasks SET state = 'in_process', user_id = ? WHERE id = ?", (user_id, task_type))
            db.db.commit()

            current_datetime = time.strftime('%d.%m.%Y. %H:%M:%S', time.localtime())

            # Send a message with the task description and start time to the user
            bot.send_message(channel_id,
                             f"{user_info.first_name} {user_info.last_name} начал Т.К.: {descriptions}\nНачало выполнения : {current_datetime}")

            # Change the button from "Начать" to "Завершить"
            finish_button = types.InlineKeyboardButton("Завершить", callback_data=f'finish_{task_type}')
            markup.add(finish_button)

            # Edit the original message to update the button
        elif data['state'] == 'not_available':
            finish_button = types.InlineKeyboardButton("Задача уже выполнена", callback_data=f'finished')
            markup.add(finish_button)

            task_start_times[chat_id] = time.time()
            task_finish_buttons[chat_id] = f'finish_{task_type}'
        else:
            if user_info.id == data['user_id']:
                finish_button = types.InlineKeyboardButton("Завершить", callback_data=f'finish_{task_type}')
                markup.add(finish_button)
            else:
                finish_button = types.InlineKeyboardButton("Над этой задачей работает другой человек",
                                                           callback_data=f'finished')
                markup.add(finish_button)
        bot.edit_message_reply_markup(chat_id=call.message.chat.id, message_id=call.message.message_id,
                                      reply_markup=markup)
    else:
        bot.send_message(chat_id=call.message.chat.id, text='Данный раздел не работает')

@bot.callback_query_handler(func=lambda call: call.data.startswith('finish_'))
def finish_task(call):
    chat_id = call.message.chat.id
    user_id = call.from_user.id
    user_info = call.from_user
    task_type = call.data.split('_')[1]  # Extract task_type from the callback data
    descriptions = get_task_description(task_type)
    # Rest of your code...

         # Используйте словарь task_buttons для получения конкретного имени задачи
    if user_id in task_start_times and task_finish_buttons.get(chat_id) == f'finish_{task_type}':
        start_time = task_start_times[chat_id]
        end_time = time.time()
        elapsed_time = end_time - start_time
        elapsed_time_str = "{:02}:{:02}:{:02}".format(int(elapsed_time // 3600), int((elapsed_time % 3600) // 60),
                                                      int(elapsed_time % 60))

        start_time_str = time.strftime('%d.%m.%Y. %H:%M:%S', time.localtime(start_time))
        end_time_str = time.strftime('%d.%m.%Y. %H:%M:%S', time.localtime(end_time))

        # Additional logic for handling the finish of the task can be added here

        response = (
            f"{user_info.first_name} {user_info.last_name} завершил выполнение {descriptions}\n"
            f"Время начала: {start_time_str}\n"
            f"Время завершения: {end_time_str}\n"
            f"Время выполнения: {elapsed_time_str}сек."
        )
        bot.send_message(channel_id, response)
        # Edit the original message only if it contains text
        new_button_text = f'Вы выполнили эту задачу'

        # Тут мы изменяем состояние кнопки на завершенную
        db.cur.execute("UPDATE tasks SET state = ? WHERE id = ?", ('not_available', call.data.split('_')[1]))
        db.db.commit()

        # Создаем новую разметку с измененным текстом кнопки
        markup = types.InlineKeyboardMarkup()
        finish_button_task = types.InlineKeyboardButton(new_button_text, callback_data='dummy_callback_data')
        markup.add(finish_button_task)

        # Изменяем оригинальное сообщение, чтобы обновить разметку и заменить кнопку
        bot.edit_message_reply_markup(chat_id=call.message.chat.id, message_id=call.message.message_id,
                                      reply_markup=types.InlineKeyboardMarkup().add(finish_button_task))


@bot.message_handler(commands=['progress'])
def progress(message):
    if message.chat.id == channel_id:  # Проверяем, что команда была вызвана в нужном чате
        # Формируем SQL-запрос для получения данных о задачах только из списка buttons
        buttons = ('sis09', 'sis10', 'sis12', 'sis26', 'sis80', 'sis148', 'Lubricaticon','Finish work', 'sis21a',
                   'sis21b', 'sis21g', 'sis23a', 'sis23b', 'sis23с', 'sis23d', 'sis23e', 'sis23q', 'sis23g', 'sis23i',
                   'sis23p', 'sis23r', 'sis23u', 'sis23o', 'sis23y', 'sis23t', 'sis24k', 'sis24m', 'sis24r', 'sis24q',
                   'sis24t', 'sis24y', 'sis24u', 'sis24o', 'sis24s', 'sis24w', 'sis24i', 'sis24p', 'sis24z', 'sis24x',
                   'sis24c','sis24f', 'sis24a', 'sis24g', 'sis24h', 'sis24j', 'sis24d', 'sis24l', 'sis26k', 'sis26b',
                   'sis26c', 'sis28a', 'sis28b', 'sis28c', 'sis28d', 'sis28f', 'sis28r', 'sis28g', 'sis28h',  'sis28j',
                   'sis29a',  'sis29b',  'sis29c', 'sis30a', 'sis30b', 'sis30c', 'sis30d', 'sis30h', 'sis30e', 'sis30f',
                   'sis30g', 'sis30q', 'sis31a', 'sis31b', 'sis31c', 'sis32a', 'sis32b', 'sis32c', 'sis33a', 'sis33b',
                   'sis33c', 'sis33d', 'sis33e', 'sis34a', 'sis34b', 'sis34c', 'sis34d', 'sis34e', 'sis34o', 'sis34g',
                   'sis34h', 'sis34j', 'sis34k', 'sis36a', 'sis36b', 'sis49a', 'sis49b', 'sis49c', 'sis49d', 'sis53a',
                   'sis53b' 'sis53c', 'sis65a', 'sis65b', 'sis65c', 'sis65d', 'sis65d1', 'sis65e', 'sis65f', 'sis65g',
                   'sis65r', 'sis65h', 'sis65j', 'sis65k', 'sis65x', 'sis65b1xx', 'sis65a1xx', 'sis65d1xx','sis71a',
                   'sis71b', 'sis71c', 'sis71d', 'sis71e', 'sis71f', 'sis71g', 'sis71h', 'sis72a', 'sis72b', 'sis72c',
                   'sis72i', 'sis72g', 'sis72d', 'sis72e', 'sis72f', 'sis72h', 'sis72j', 'sis72k', 'sis72l', 'sis72q',
                   'sis73a', 'sis73b', 'sis73c', 'sis73d', 'sis73e', 'sis73f', 'sis73l', 'sis73a1',  'sis77a',
                   'sis77b', 'sis77c', 'sis77d', 'sis78a', ' sis84a', 'sis84b', 'sis84c', 'sis84d', 'sis84e', 'sis84f',
                   'sis84g', 'sis84h', 'sis84j', 'sis84k', 'sis84t', 'sis84s', 'sis84a1xx', 'sis84b1xx', 'sis110a',
                   'sis110b', 'sis110c', 'sis110d', 'sis110e', 'sis110f', 'sis110g', 'sis110h', 'sis110g', 'sis110j',
                   'sis110k', 'sis110l', 'sis110q', 'sis110w', 'sis110r', 'sis113a', 'sis113b', 'sis117a', 'sis117b',
                   'sis129a', 'sis129b', 'sis131a', 'sis131b', 'sis131c', 'sis131d', 'sis142a','sis142b','sis142c')
        placeholder = ','.join('?' * len(buttons))
        all_tasks = cur.execute(f"SELECT * FROM tasks WHERE id IN ({placeholder})", buttons).fetchall()

        # Отладочный вывод
        print("All tasks in progress:", all_tasks)

        total_tasks = len(all_tasks)
        completed_tasks_count = len([task for task in all_tasks if task[1] == 'not_available'])
        progress_percentage = (completed_tasks_count / total_tasks) * 100 if total_tasks > 0 else 0

        response = "Прогресс выполнения задач:\n"
        response += f"Общее количество задач: {total_tasks}\n"
        response += f"Количество выполненных задач: {completed_tasks_count}\n"
        response += f"Процент выполненной работы: {progress_percentage:.2f}%\n"

        bot.send_message(message.chat.id, response)
    else:
        bot.send_message(message.chat.id, "Вы не можете вызвать эту команду в данном чате.")


@bot.message_handler(commands=['no_start'])
def list_not_started_tasks(message):
    tasks = cur.execute("SELECT * FROM tasks WHERE state = 'not_started'").fetchall()

    # Отладочный вывод
    print("Tasks not started:", tasks)

    if tasks:
        response = "Задачи, которые еще не начаты:\n"
        for task in tasks:
            task_type = task[0]
            description = get_task_description(task_type)
            response += f"- {description}\n"
        bot.send_message(message.chat.id, response)
    else:
        bot.send_message(message.chat.id, "Все задачи в настоящее время выполняются или завершены.")


@bot.message_handler(commands=['tasks'])
def list_task_users(message):

    tasks = cur.execute("SELECT * FROM tasks WHERE state = 'in_process'").fetchall()
    if tasks:
        response = "Пользователи, начавшие выполнение задач:\n"
        for task in tasks:
            task_type = task[0]  # Исправлено
            user_id = task[2]
            start_time = task[3]  # Получаем время начала выполнения
            formatted_start_time = time.strftime('%d.%m.%Y. %H:%M:%S', time.localtime(start_time))
            user_info = bot.get_chat_member(channel_id, user_id)  # Необходимо определить channel_id
            description = get_task_description(task_type)  # Исправлено
            response += f"- {user_info.user.first_name} {user_info.user.last_name}\n {description}\n Начало выполнения: {formatted_start_time}\n"  # Исправлено
        bot.send_message(message.chat.id, response)
    else:
        bot.send_message(message.chat.id, "В настоящее время никто не выполняет задачи.")

@bot.message_handler(commands=['pass'])
def set_password(message):
    # Проверяем, что сообщение пришло из чата, к которому привязан бот
    if message.chat.id == channel_id:
        bot.send_message(message.chat.id, "Введите новый пароль:")
        # После отправки сообщения запроса о новом пароле регистрируем обработчик для следующего шага
        bot.register_next_step_handler(message, update_password)

def update_password(message):
    # Обновляем глобальную переменную с паролем
    global STATIC_PASSWORD
    new_password = message.text.strip()
    STATIC_PASSWORD = new_password
    bot.send_message(message.chat.id, f"Пароль успешно обновлен на '{new_password}'.")

@bot.message_handler(commands=['getid'])
def get_id(message):
    bot.send_message(message.chat.id, f"ID чата: {message.chat.id}")


if __name__ == "__main__":
    db.db_start()
    bot.polling(none_stop=True)
